[
  {
    "grade": "Kindergarten",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 1,
    "title": "Exchanging information and ideas",
    "ccss_ela": "SL.K.1, 6; L.K.1, 6",
    "emerging": "Contribute to conversations and express ideas by asking and answering yes-no and wh- questions and responding using gestures, words, and simple phrases.",
    "expanding": "Contribute to class, group, and partner discussions by listening attentively, following turn-taking rules, and asking and answering questions.",
    "bridging": "Contribute to class, group, and partner discussions by listening attentively, following turn-taking rules, and asking and answering questions."
  },
  {
    "grade": "Kindergarten",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 2,
    "title": "Interacting via written English",
    "ccss_ela": "W.K.6; SL.K.1; L.K.1, 6",
    "emerging": "Collaborate with the teacher and peers on joint composing projects of short informational and literary texts that include minimal writing (labeling with a few words), using technology, where appropriate, for publishing, graphics, and the like.",
    "expanding": "Collaborate with the teacher and peers on joint composing projects of informational and literary texts that include some writing (e.g., short sentences), using technology, where appropriate, for publishing, graphics, and the like.",
    "bridging": "Collaborate with the teacher and peers on joint composing projects of informational and literary texts that include a greater amount of writing (e.g., a very short story), using technology, where appropriate, for publishing, graphics, and the like."
  },
  {
    "grade": "Kindergarten",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 3,
    "title": "Offering opinions",
    "ccss_ela": "W.K.1; SL.K.1, 6; L.K.1, 6",
    "emerging": "Offer opinions and ideas in conversations using a small set of learned phrases (e.g., I think X), as well as open responses.",
    "expanding": "Offer opinions in conversations using an expanded set of learned phrases (e.g., I think/don't think X. I agree with X), as well as open responses, in order to gain and/or hold the floor.",
    "bridging": "Offer opinions in conversations using an expanded set of learned phrases (e.g., I think/don't think X. I agree with X, but...), as well as open responses, in order to gain and/or hold the floor or add information to an idea."
  },
  {
    "grade": "Kindergarten",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 4,
    "title": "Adapting language choices",
    "ccss_ela": "W.K.5; SL.K.6; L.K.6",
    "emerging": "No standard for kindergarten.",
    "expanding": "No standard for kindergarten.",
    "bridging": "No standard for kindergarten."
  },
  {
    "grade": "Kindergarten",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 5,
    "title": "Listening actively",
    "ccss_ela": "SL.K.1, 2, 3; L.K.6",
    "emerging": "Demonstrate active listening to read-alouds and oral presentations by asking and answering yes-no and wh- questions with oral sentence frames and substantial prompting and support.",
    "expanding": "Demonstrate active listening to read-alouds and oral presentations by asking and answering questions with oral sentence frames and occasional prompting and support.",
    "bridging": "Demonstrate active listening to read-alouds and oral presentations by asking and answering detailed questions with minimal prompting and light support."
  },
  {
    "grade": "Kindergarten",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 6,
    "title": "Reading/viewing closely",
    "ccss_ela": "RL.K.1, 2, 3, 7, 9; RI.K.1, 2, 3, 7, 9; SL.K.2, 3; L.K.6",
    "emerging": "Describe ideas, phenomena (e.g., how earthworms eat), and text elements (e.g., setting, characters) based on understanding of a select set of grade-level texts and viewing of multimedia, with substantial support.",
    "expanding": "Describe ideas, phenomena (e.g., plant life cycle), and text elements (e.g., setting, characters) based on understanding of a variety of grade-level texts and viewing of multimedia, with moderate support.",
    "bridging": "Describe ideas, phenomena (e.g., erosion), and text elements (e.g., setting, characters) using key details based on understanding of a variety of grade-level texts and viewing of multimedia, with light support."
  },
  {
    "grade": "Kindergarten",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 7,
    "title": "Evaluating language choices",
    "ccss_ela": "RL.K.4; RI.K.4; SL.K.6; L.K.6",
    "emerging": "Describe the language writers or speakers use to present an idea (e.g., the words and phrases used to describe a character), with prompting and substantial support.",
    "expanding": "Describe the language writers or speakers use to present or support an idea (e.g., the adjectives used to describe people and places), with prompting and moderate support.",
    "bridging": "Describe the language writers or speakers use to present or support an idea (e.g., the author's choice of vocabulary to portray characters, places, or real people), with prompting and light support."
  },
  {
    "grade": "Kindergarten",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 8,
    "title": "Analyzing language choices",
    "ccss_ela": "RL.K.4; RI.K.4; L.K.5, 6",
    "emerging": "Distinguish how two different frequently used words (e.g., large versus small) produce a different effect on the audience.",
    "expanding": "Distinguish how two different words with similar meaning (e.g., large versus enormous) produce shades of meaning and a different effect on the audience.",
    "bridging": "Distinguish how multiple different words with similar meaning (e.g., big, large, huge, enormous, gigantic) produce shades of meaning and a different effect on the audience."
  },
  {
    "grade": "Kindergarten",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 9,
    "title": "Presenting",
    "ccss_ela": "SL.K.4, 5, 6; L.K.6",
    "emerging": "Plan and deliver very brief oral presentations (e.g., show and tell, describing a picture).",
    "expanding": "Plan and deliver brief oral presentations on a variety of topics (e.g., show and tell, author's chair, recounting an experience, describing an animal).",
    "bridging": "Plan and deliver longer oral presentations on a variety of topics (e.g., show and tell, author's chair, recounting an experience, describing an animal)."
  },
  {
    "grade": "Kindergarten",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 10,
    "title": "Writing",
    "ccss_ela": "W.K.1, 2, 3, 5, 6, 7, 8; L.K.6",
    "emerging": "Write very short literary texts (e.g., story) and informational texts (e.g., a description of an insect) using familiar vocabulary collaboratively with an adult (e.g., joint construction of texts), with peers, and sometimes independently.",
    "expanding": "Write short literary texts (e.g., a story) and informational texts (e.g., an informative text on the life cycle of an insect) collaboratively with an adult (e.g., joint construction of texts), with peers, and with increasing independence.",
    "bridging": "Write longer literary texts (e.g., a story) and informational texts (e.g., an informative text on the life cycle of insects) collaboratively with an adult (e.g., joint construction), with peers, and independently."
  },
  {
    "grade": "Kindergarten",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 11,
    "title": "Supporting opinions",
    "ccss_ela": "W.K.1; SL.K.4, 6; L.K.6",
    "emerging": "Offer opinions and provide good reasons (e.g., My favorite book is X because X) referring to the text or to relevant background knowledge.",
    "expanding": "Offer opinions and provide good reasons and some textual evidence or relevant background knowledge (e.g., paraphrased examples from text or knowledge of content).",
    "bridging": "Offer opinions and provide good reasons with detailed textual evidence or relevant background knowledge (e.g., specific examples from text or knowledge of content)."
  },
  {
    "grade": "Kindergarten",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 12,
    "title": "Selecting language resources",
    "ccss_ela": "SL.K.4, 6; L.K.1, 5, 6",
    "emerging": "a. Retell texts and recount experiences using key words.<br>b. Use a select number of general academic and domain-specific words to add detail (e.g., adding the word scrumptious to describe a favorite food, using the word thorax to refer to insect anatomy) while speaking and writing.",
    "expanding": "a. Retell texts and recount experiences using complete sentences and key words.<br>b. Use a growing number of general academic and domain-specific words in order to add detail, create an effect (e.g., using the word suddenly to signal a change), or create shades of meaning (e.g., prance versus walk) while speaking and writing.",
    "bridging": "a. Retell texts and recount experiences using increasingly detailed complete sentences and key words.<br>b. Use a wide variety of general academic and domain-specific words, synonyms, antonyms, and non-literal language (e.g., The dog was as big as a house) to create an effect, precision, and shades of meaning while speaking and writing."
  },
  {
    "grade": "Kindergarten",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 1,
    "title": "Understanding text structure",
    "ccss_ela": "RL.K.5; RI.K.5; W.K.1, 2, 3, 5; SL.K.4",
    "emerging": "Apply understanding of how text types are organized (e.g., how a story is organized by a sequence of events) to comprehending texts and composing basic texts with substantial support (e.g., using drawings, through joint construction with a peer or teacher).",
    "expanding": "Apply understanding of how different text types are organized to express ideas (e.g., how a story is organized sequentially with predictable stages versus how an informative text is organized by topic and details) to comprehending texts and writing texts in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "Apply understanding of how different text types are organized predictably to express ideas (e.g., how a story is organized versus an informative/explanatory text versus an opinion text) to comprehending texts and writing texts in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Kindergarten",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 2,
    "title": "Understanding cohesion",
    "ccss_ela": "RL.K.5; RI.K.5; W.K.1, 2, 3, 5; SL.K.4; L.K.1",
    "emerging": "Apply basic understanding of how ideas, events, or reasons are linked throughout a text using more everyday connecting words or phrases (e.g., one day, after, then) to comprehending texts and writing texts in shared language activities guided by the teacher, with peers, and sometimes independently.",
    "expanding": "Apply understanding of how ideas, events, or reasons are linked throughout a text using a growing number of connecting words or phrases (e.g., after a long time, first/next) to comprehending texts and writing texts in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "Apply understanding of how ideas, events, or reasons are linked throughout a text using a variety of connecting words or phrases (e.g., for example, after that, suddenly) to comprehending texts and writing texts in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Kindergarten",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 3,
    "title": "Using verbs and verb phrases",
    "ccss_ela": "W.K.5; SL.K.6; L.K.1, 6",
    "emerging": "a. Use frequently used verbs (e.g., go, eat, run) and verb types (e.g., doing, saying, being/having, thinking/feeling) in shared language activities guided by the teacher and sometimes independently.<br>b. Use simple verb tenses appropriate for the text type and discipline to convey time (e.g., simple past for recounting an experience) in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "a. Use a growing number of verbs and verb types (e.g., doing, saying, being/having, thinking/feeling) in shared language activities guided by the teacher and with increasing independence.<br>b. Use a growing number of verb tenses appropriate for the text type and discipline to convey time (e.g., simple past tense for retelling, simple present for a science description) in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "a. Use a wide variety of verbs and verb types (e.g., doing, saying, being/having, thinking/feeling) in shared language activities guided by the teacher and independently.<br>b. Use a wide variety of verb tenses appropriate for the text type and discipline to convey time (e.g., simple present for a science description, simple future to predict) in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Kindergarten",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 4,
    "title": "Using nouns and noun phrases",
    "ccss_ela": "W.K.5; SL.K.6; L.K.1, 6",
    "emerging": "Expand noun phrases in simple ways (e.g., adding a familiar adjective to describe a noun) in order to enrich the meaning of sentences and add details about ideas, people, things, and the like, in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "Expand noun phrases in a growing number of ways (e.g., adding a newly learned adjective to a noun) to enrich the meaning of sentences and add details about ideas, people, things, and the like, in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "Expand noun phrases in a wide variety of ways (e.g., adding a variety of adjectives to noun phrases) in order to enrich the meaning of phrases/sentences and add details about ideas, people, things, and the like, in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Kindergarten",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 5,
    "title": "Modifying to add details",
    "ccss_ela": "W.K.5; SL.K.6; L.K.1, 6",
    "emerging": "Expand sentences with frequently used prepositional phrases (such as in the house, on the boat) to provide details (e.g., time, manner, place, cause) about a familiar activity or process in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "Expand sentences with prepositional phrases to provide details (e.g., time, manner, place, cause) about a familiar or new activity or process in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "Expand simple and compound sentences with prepositional phrases to provide details (e.g., time, manner, place, cause) in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Kindergarten",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 6,
    "title": "Connecting ideas",
    "ccss_ela": "W.K.1, 2, 3, 5; SL.K.4, 6; L.K.1, 6",
    "emerging": "Combine clauses in a few basic ways to make connections between and to join ideas (e.g., creating compound sentences using and, but, so) in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "Combine clauses in an increasing variety of ways to make connections between and to join ideas, for example, to express cause/effect (e.g., She jumped because the dog barked) in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "Combine clauses in a wide variety of ways (e.g., rearranging complete, simple-to-form compound sentences) to make connections between and to join ideas (e.g., The boy was hungry. The boy ate a sandwich. -> The boy was hungry so he ate a sandwich) in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Kindergarten",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 7,
    "title": "Condensing ideas",
    "ccss_ela": "W.K.1, 2, 3, 5; SL.K.4, 6; L.K.1, 6",
    "emerging": "Condense clauses in simple ways (e.g., changing: I like blue. I like red. I like purple -> I like blue, red, and purple) to create precise and detailed sentences in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "Condense clauses in a growing number of ways (e.g., through embedded clauses as in, She's a doctor. She saved the animals. -> She's the doctor who saved the animals) to create precise and detailed sentences in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "Condense clauses in a variety of ways (e.g., through embedded clauses and other condensing, for example, through embedded clauses as in, She's a doctor. She's amazing. She saved the animals. -> She's the amazing doctor who saved the animals) to create precise and detailed sentences in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Grade 1",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 1,
    "title": "Exchanging information and ideas",
    "ccss_ela": "SL.1.1, 6; L.1.1, 6",
    "emerging": "Contribute to conversations and express ideas by asking and answering yes-no and wh- questions and responding using gestures, words, and simple phrases.",
    "expanding": "Contribute to class, group, and partner discussions by listening attentively, following turn-taking rules, and asking and answering questions.",
    "bridging": "Contribute to class, group, and partner discussions by listening attentively, following turn-taking rules, and asking and answering questions."
  },
  {
    "grade": "Grade 1",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 2,
    "title": "Interacting via written English",
    "ccss_ela": "W.1.6; SL.1.1; L.1.1, 6",
    "emerging": "Collaborate with teacher and peers on joint writing projects of short informational and literary texts, using technology where appropriate for publishing, graphics, and the like.",
    "expanding": "Collaborate with peers on joint writing projects of longer informational and literary texts, using technology where appropriate for publishing, graphics, and the like.",
    "bridging": "Collaborate with peers on joint writing projects of longer informational and literary texts, using technology where appropriate for publishing, graphics, and the like."
  },
  {
    "grade": "Grade 1",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 3,
    "title": "Offering opinions",
    "ccss_ela": "W.1.1; SL.1.1, 6; L.1.1, 6",
    "emerging": "Offer opinions and ideas in conversations using a small set of learned phrases (e.g., I think X), as well as open responses in order to gain and/or hold the floor.",
    "expanding": "Offer opinions and negotiate with others in conversations using an expanded set of learned phrases (e.g., I think/don't think X. I agree with X), as well as open responses in order to gain and/or hold the floor, elaborate on an idea, and so on.",
    "bridging": "Offer opinions and negotiate with others in conversations using an expanded set of learned phrases (e.g., I think/don't think X. I agree with X), and open responses in order to gain and/or hold the floor, elaborate on an idea, provide different opinions, and so on."
  },
  {
    "grade": "Grade 1",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 4,
    "title": "Adapting language choices",
    "ccss_ela": "W.1.5; SL.1.6; L.1.6",
    "emerging": "No standard for grade 1.",
    "expanding": "No standard for grade 1.",
    "bridging": "No standard for grade 1."
  },
  {
    "grade": "Grade 1",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 5,
    "title": "Listening actively",
    "ccss_ela": "SL.1.1, 2, 3; L.1.6",
    "emerging": "Demonstrate active listening to read-alouds and oral presentations by asking and answering yes-no and wh- questions with oral sentence frames and substantial prompting and support.",
    "expanding": "Demonstrate active listening to read-alouds and oral presentations by asking and answering questions, with oral sentence frames and occasional prompting and support.",
    "bridging": "Demonstrate active listening to read-alouds and oral presentations by asking and answering detailed questions, with minimal prompting and light support."
  },
  {
    "grade": "Grade 1",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 6,
    "title": "Reading/viewing closely",
    "ccss_ela": "RL.1.1, 2, 3, 7, 9; RI.1.1, 2, 3, 7, 9; SL.1.2, 3; L.1.6",
    "emerging": "Describe ideas, phenomena (e.g., how earthworms eat), and text elements (e.g., setting, main idea) based on understanding of a select set of grade-level texts and viewing of multimedia, with substantial support.",
    "expanding": "Describe ideas, phenomena (e.g., plant life cycle), and text elements (e.g., setting, main idea) in greater detail based on understanding of a variety of grade-level texts and viewing of multimedia, with moderate support.",
    "bridging": "Describe ideas, phenomena (e.g., erosion), and text elements (e.g., central message, character traits) using key details based on understanding of a variety of grade-level texts and viewing of multimedia, with light support."
  },
  {
    "grade": "Grade 1",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 7,
    "title": "Evaluating language choices",
    "ccss_ela": "RL.1.4; RI.1.4; SL.1.6; L.1.6",
    "emerging": "Describe the language writers or speakers use to present an idea (e.g., the words and phrases used to describe a character), with prompting and substantial support.",
    "expanding": "Describe the language writers or speakers use to present or support an idea (e.g., the adjectives used to describe people and places), with prompting and moderate support.",
    "bridging": "Describe the language writers or speakers use to present or support an idea (e.g., the author's choice of vocabulary to portray characters, places, or real people) with prompting and light support."
  },
  {
    "grade": "Grade 1",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 8,
    "title": "Analyzing language choices",
    "ccss_ela": "RL.1.4; RI.1.4; L.1.5, 6",
    "emerging": "Distinguish how two different frequently used words (e.g., large versus small) produce a different effect on the audience.",
    "expanding": "Distinguish how two different words with similar meaning (e.g., large versus enormous) produce shades of meaning and a different effect on the audience.",
    "bridging": "Distinguish how multiple different words with similar meaning (e.g., big, large, huge, enormous, gigantic) produce shades of meaning and a different effect on the audience."
  },
  {
    "grade": "Grade 1",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 9,
    "title": "Presenting",
    "ccss_ela": "SL.1.4, 5, 6; L.1.6",
    "emerging": "Plan and deliver very brief oral presentations (e.g., show and tell, describing a picture).",
    "expanding": "Plan and deliver brief oral presentations on a variety of topics (e.g., show and tell, author's chair, recounting an experience, describing an animal, and the like).",
    "bridging": "Plan and deliver longer oral presentations on a variety of topics in a variety of content areas (e.g., retelling a story, describing a science experiment)."
  },
  {
    "grade": "Grade 1",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 10,
    "title": "Writing",
    "ccss_ela": "W.1.1, 2, 3, 5, 6, 7, 8; L.1.6",
    "emerging": "Write very short literary texts (e.g., story) and informational texts (e.g., a description of an insect) using familiar vocabulary collaboratively with an adult (e.g., joint construction of texts), with peers, and sometimes independently.",
    "expanding": "Write short literary texts (e.g., a story) and informational texts (e.g., an informative text on the life cycle of an insect) collaboratively with an adult (e.g., joint construction of texts), with peers, and with increasing independence.",
    "bridging": "Write longer literary texts (e.g., a story) and informational texts (e.g., an informative text on the life cycle of insects) collaboratively with an adult (e.g., joint construction), with peers, and independently."
  },
  {
    "grade": "Grade 1",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 11,
    "title": "Supporting opinions",
    "ccss_ela": "W.1.1; SL.1.4, 6; L.1.6",
    "emerging": "Offer opinions and provide good reasons (e.g., My favorite book is X because X) referring to the text or to relevant background knowledge.",
    "expanding": "Offer opinions and provide good reasons and some textual evidence or relevant background knowledge (e.g., paraphrased examples from text or knowledge of content).",
    "bridging": "Offer opinions and provide good reasons with detailed textual evidence or relevant background knowledge (e.g., specific examples from text or knowledge of content)."
  },
  {
    "grade": "Grade 1",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 12,
    "title": "Selecting language resources",
    "ccss_ela": "SL.1.4, 6; L.1.1, 5, 6",
    "emerging": "a. Retell texts and recount experiences, using key words.<br>b. Use a select number of general academic and domain-specific words to add detail (e.g., adding the word scrumptious to describe a favorite food, using the word thorax to refer to insect anatomy) while speaking and writing.",
    "expanding": "a. Retell texts and recount experiences, using complete sentences and key words.<br>b. Use a growing number of general academic and domain-specific words in order to add detail, create an effect (e.g., using the word suddenly to signal a change), or create shades of meaning (e.g., prance versus walk) while speaking and writing.",
    "bridging": "a. Retell texts and recount experiences, using increasingly detailed complete sentences and key words.<br>b. Use a wide variety of general academic and domain-specific words, synonyms, antonyms, and non-literal language (e.g., The dog was as big as a house) to create an effect, precision, and shades of meaning while speaking and writing."
  },
  {
    "grade": "Grade 1",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 1,
    "title": "Understanding text structure",
    "ccss_ela": "RL.1.5; RI.1.5; W.1.1, 2, 3, 5; SL.1.4",
    "emerging": "Apply understanding of how text types are organized (e.g., how a story is organized by a sequence of events) to comprehending texts and composing basic texts with substantial support (e.g., using drawings, through joint construction with a peer or teacher).",
    "expanding": "Apply understanding of how different text types are organized to express ideas (e.g., how a story is organized sequentially with predictable stages versus how an informative text is organized by topic and details) to comprehending texts and writing texts in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "Apply understanding of how different text types are organized predictably to express ideas (e.g., how a story is organized versus an informative/explanatory text versus an opinion text) to comprehending texts and writing texts in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Grade 1",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 2,
    "title": "Understanding cohesion",
    "ccss_ela": "RL.1.5; RI.1.5; W.1.1, 2, 3, 5; SL.1.4; L.1.1",
    "emerging": "Apply basic understanding of how ideas, events, or reasons are linked throughout a text using more everyday connecting words or phrases (e.g., one day, after, then) to comprehending texts and writing texts in shared language activities guided by the teacher, with peers, and sometimes independently.",
    "expanding": "Apply understanding of how ideas, events, or reasons are linked throughout a text using a growing number of connecting words or phrases (e.g., after a long time, first/next) to comprehending texts and writing texts in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "Apply understanding of how ideas, events, or reasons are linked throughout a text using a variety of connecting words or phrases (e.g., for example, after that, suddenly) to comprehending texts and writing texts in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Grade 1",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 3,
    "title": "Using verbs and verb phrases",
    "ccss_ela": "W.1.5; SL.1.6; L.1.1, 6",
    "emerging": "a. Use frequently used verbs (e.g., go, eat, run) and verb types (e.g., doing, saying, being/having, thinking/feeling) in shared language activities guided by the teacher and sometimes independently.<br>b. Use simple verb tenses appropriate for the text type and discipline to convey time (e.g., simple past for recounting an experience) in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "a. Use a growing number of verbs and verb types (e.g., doing, saying, being/having, thinking/feeling) in shared language activities guided by the teacher and with increasing independence.<br>b. Use a growing number of verb tenses appropriate for the text type and discipline to convey time (e.g., simple past tense for retelling, simple present for a science description) in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "a. Use a wide variety of verbs and verb types (e.g., doing, saying, being/having, thinking/feeling) in shared language activities guided by the teacher and independently.<br>b. Use a wide variety of verb tenses appropriate for the text type and discipline to convey time (e.g., simple present for a science description, simple future to predict) in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Grade 1",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 4,
    "title": "Using nouns and noun phrases",
    "ccss_ela": "W.1.5; SL.1.6; L.1.1, 6",
    "emerging": "Expand noun phrases in simple ways (e.g., adding a familiar adjective to describe a noun) in order to enrich the meaning of sentences and add details about ideas, people, things, and the like, in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "Expand noun phrases in a growing number of ways (e.g., adding a newly learned adjective to a noun) to enrich the meaning of sentences and add details about ideas, people, things, and the like, in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "Expand noun phrases in a wide variety of ways (e.g., adding a variety of adjectives to noun phrases) in order to enrich the meaning of phrases/sentences and add details about ideas, people, things, and the like, in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Grade 1",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 5,
    "title": "Modifying to add details",
    "ccss_ela": "W.1.5; SL.1.6; L.1.1, 6",
    "emerging": "Expand sentences with frequently used prepositional phrases (such as in the house, on the boat) to provide details (e.g., time, manner, place, cause) about a familiar activity or process in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "Expand sentences with prepositional phrases to provide details (e.g., time, manner, place, cause) about a familiar or new activity or process in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "Expand simple and compound sentences with prepositional phrases to provide details (e.g., time, manner, place, cause) in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Grade 1",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 6,
    "title": "Connecting ideas",
    "ccss_ela": "W.1.1, 2, 3, 5; SL.1.4, 6; L.1.1, 6",
    "emerging": "Combine clauses in a few basic ways to make connections between and to join ideas (e.g., creating compound sentences using and, but, so) in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "Combine clauses in an increasing variety of ways to make connections between and to join ideas, for example, to express cause/effect (e.g., She jumped because the dog barked) in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "Combine clauses in a wide variety of ways (e.g., rearranging complete, simple-to-form compound sentences) to make connections between and to join ideas (e.g., The boy was hungry. The boy ate a sandwich. -> The boy was hungry so he ate a sandwich) in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Grade 1",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 7,
    "title": "Condensing ideas",
    "ccss_ela": "W.1.1, 2, 3, 5; SL.1.4, 6; L.1.1, 6",
    "emerging": "Condense clauses in simple ways (e.g., changing: I like blue. I like red. I like purple -> I like blue, red, and purple) to create precise and detailed sentences in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "Condense clauses in a growing number of ways (e.g., through embedded clauses as in, She's a doctor. She saved the animals. -> She's the doctor who saved the animals) to create precise and detailed sentences in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "Condense clauses in a variety of ways (e.g., through embedded clauses and other condensing, for example, through embedded clauses as in, She's a doctor. She's amazing. She saved the animals. -> She's the amazing doctor who saved the animals) to create precise and detailed sentences in shared language activities guided by the teacher and independently."
  },
  {
    "grade": "Grade 2",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 1,
    "title": "Exchanging information and ideas",
    "ccss_ela": "SL.2.1, 6; L.2.1, 6",
    "emerging": "Contribute to conversations and express ideas by asking and answering yes-no and wh- questions and responding using gestures, words, and learned phrases.",
    "expanding": "Contribute to class, group, and partner discussions, including sustained dialogue, by listening attentively, following turn-taking rules, asking relevant questions, affirming others, and adding relevant information.",
    "bridging": "Contribute to class, group, and partner discussions, including sustained dialogue, by listening attentively, following turn-taking rules, asking relevant questions, affirming others, adding pertinent information, building on responses, and providing useful feedback."
  },
  {
    "grade": "Grade 2",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 1,
    "title": "Exchanging information and ideas",
    "emerging": "Contribute to conversations and express ideas by asking and answering yes-no and wh- questions and responding using gestures, words, and learned phrases.",
    "expanding": "Contribute to class, group, and partner discussions, including sustained dialogue, by listening attentively, following turn-taking rules, asking relevant questions, affirming others, and adding relevant information.",
    "bridging": "Contribute to class, group, and partner discussions, including sustained dialogue, by listening attentively, following turn-taking rules, asking relevant questions, affirming others, adding pertinent information, building on responses, and providing useful feedback."
  },
  {
    "grade": "Grade 2",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 2,
    "title": "Interacting via written English",
    "emerging": "Collaborate with peers on joint writing projects of short informational and literary texts, using technology where appropriate for publishing, graphics, and the like.",
    "expanding": "Collaborate with peers on joint writing projects of longer informational and literary texts, using technology where appropriate for publishing, graphics, and the like.",
    "bridging": "Collaborate with peers on joint writing projects of a variety of longer informational and literary texts, using technology where appropriate for publishing, graphics, and the like."
  },
  {
    "grade": "Grade 2",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 3,
    "title": "Offering opinions",
    "emerging": "Offer opinions and negotiate with others in conversations using learned phrases (e.g., I think X), as well as open responses, in order to gain and/or hold the floor.",
    "expanding": "Offer opinions and negotiate with others in conversations using an expanded set of learned phrases (e.g., I agree with X, but X), as well as open responses, in order to gain and/or hold the floor, provide counterarguments, and the like.",
    "bridging": "Offer opinions and negotiate with others in conversations using a variety of learned phrases (e.g., That's a good idea, but X), as well as open responses, in order to gain and/or hold the floor, provide counterarguments, elaborate on an idea, and the like."
  },
  {
    "grade": "Grade 2",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 4,
    "title": "Adapting language choices",
    "emerging": "Recognize that language choices (e.g., vocabulary) vary according to social setting (e.g., playground versus classroom), with substantial support from peers or adults.",
    "expanding": "Adjust language choices (e.g., vocabulary, use of dialogue, and so on) according to purpose (e.g., persuading, entertaining), task, and audience (e.g., peers versus adults), with moderate support from peers or adults.",
    "bridging": "Adjust language choices according to purpose (e.g., persuading, entertaining), task, and audience (e.g., peer-to-peer versus peer-to-teacher), with light support from peers or adults."
  },
  {
    "grade": "Grade 2",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 5,
    "title": "Listening actively",
    "emerging": "Demonstrate active listening to read-alouds and oral presentations by asking and answering basic questions, with oral sentence frames and substantial prompting and support.",
    "expanding": "Demonstrate active listening to read-alouds and oral presentations by asking and answering detailed questions, with oral sentence frames and occasional prompting and support.",
    "bridging": "Demonstrate active listening to read-alouds and oral presentations by asking and answering detailed questions, with minimal prompting and light support."
  },
  {
    "grade": "Grade 2",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 6,
    "title": "Reading/viewing closely",
    "emerging": "Describe ideas, phenomena (e.g., how earthworms eat), and text elements (e.g., setting, main idea) based on understanding of a select set of grade-level texts and viewing of multimedia, with substantial support.",
    "expanding": "Describe ideas, phenomena (e.g., plant life cycle), and text elements (e.g., main idea, characters, events) in greater detail based on understanding of a variety of grade-level texts and viewing of multimedia, with moderate support.",
    "bridging": "Describe ideas, phenomena (e.g., erosion), and text elements (e.g., central message, character traits) using key details based on understanding of a variety of grade-level texts and viewing of multimedia, with light support."
  },
  {
    "grade": "Grade 2",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 7,
    "title": "Evaluating language choices",
    "emerging": "Describe the language writers or speakers use to present an idea (e.g., the words and phrases used to describe a character), with prompting and substantial support.",
    "expanding": "Describe the language writers or speakers use to present or support an idea (e.g., the adjectives used to describe people and places), with prompting and moderate support.",
    "bridging": "Describe the language writers or speakers use to present or support an idea (e.g., the author's choice of vocabulary to portray characters, places, or real people)."
  },
  {
    "grade": "Grade 2",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 8,
    "title": "Analyzing language choices",
    "emerging": "Distinguish how two different frequently used words (e.g., large versus small) produce a different effect on the audience.",
    "expanding": "Distinguish how two different words with similar meaning (e.g., large versus enormous) produce shades of meaning and a different effect on the audience.",
    "bridging": "Distinguish how multiple different words with similar meaning (e.g., big, large, huge, enormous, gigantic) produce shades of meaning and a different effect on the audience."
  },
  {
    "grade": "Grade 2",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 9,
    "title": "Presenting",
    "emerging": "Plan and deliver very brief oral presentations (e.g., recounting an experience, retelling a story, describing a picture).",
    "expanding": "Plan and deliver brief oral presentations on a variety of topics (e.g., retelling a story, describing an animal).",
    "bridging": "Plan and deliver longer oral presentations on a variety of topics and content areas (e.g., retelling a story, recounting a science experiment, describing how to solve a mathematics problem)."
  },
  {
    "grade": "Grade 2",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 10,
    "title": "Writing",
    "emerging": "Write very short literary texts (e.g., story) and informational texts (e.g., a description of a volcano) using familiar vocabulary collaboratively with an adult (e.g., joint construction of texts), with peers, and sometimes independently.",
    "expanding": "Write short literary texts (e.g., a story) and informational texts (e.g., an explanatory text explaining how a volcano erupts) collaboratively with an adult (e.g., joint construction of texts), with peers, and with increasing independence.",
    "bridging": "Write longer literary texts (e.g., a story) and informational texts (e.g., an explanatory text explaining how a volcano erupts) collaboratively with an adult (e.g., joint construction), with peers and independently."
  },
  {
    "grade": "Grade 2",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 11,
    "title": "Supporting opinions",
    "emerging": "Support opinions by providing good reasons and some textual evidence or relevant background knowledge (e.g., referring to textual evidence or knowledge of content).",
    "expanding": "Support opinions by providing good reasons and increasingly detailed textual evidence (e.g., providing examples from the text) or relevant background knowledge about the content.",
    "bridging": "Support opinions or persuade others by providing good reasons and detailed textual evidence (e.g., specific events or graphics from text) or relevant background knowledge about the content."
  },
  {
    "grade": "Grade 2",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 12,
    "title": "Selecting language resources",
    "emerging": "a. Retell texts and recount experiences by using key words.<br>b. Use a select number of general academic and domain-specific words to add detail (e.g., adding the word generous to describe a character, using the word lava to explain volcanic eruptions) while speaking and writing.",
    "expanding": "a. Retell texts and recount experiences using complete sentences and key words.<br>b. Use a growing number of general academic and domain-specific words in order to add detail, create an effect (e.g., using the word suddenly to signal a change), or create shades of meaning (e.g., scurry versus dash) while speaking and writing.",
    "bridging": "a. Retell texts and recount experiences using increasingly detailed complete sentences and key words.<br>b. Use a wide variety of general academic and domain-specific words, synonyms, antonyms, and non-literal language (e.g., He was as quick as a cricket) to create an effect, precision, and shades of meaning while speaking and writing."
  },
  {
    "grade": "Grade 2",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 1,
    "title": "Understanding text structure",
    "emerging": "Apply understanding of how different text types are organized to express ideas (e.g., how a story is organized sequentially) to comprehending and composing texts in shared language activities guided by the teacher, with peers, and sometimes independently.",
    "expanding": "Apply understanding of how different text types are organized to express ideas (e.g., how a story is organized sequentially with predictable stages versus how an information report is organized by topic and details) to comprehending texts and composing texts with increasing independence.",
    "bridging": "Apply understanding of how different text types are organized predictably to express ideas (e.g., a narrative versus an informative/explanatory text versus an opinion text) to comprehending and writing texts independently."
  },
  {
    "grade": "Grade 2",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 2,
    "title": "Understanding cohesion",
    "emerging": "Apply basic understanding of how ideas, events, or reasons are linked throughout a text using more everyday connecting words or phrases (e.g., one day, after, then) to comprehending texts and writing texts in shared language activities guided by the teacher, with peers, and sometimes independently.",
    "expanding": "Apply understanding of how ideas, events, or reasons are linked throughout a text using a growing number of connecting words or phrases (e.g., after a long time, first/next) to comprehending texts and writing texts in shared language activities guided by the teacher and with increasing independence.",
    "bridging": "Apply understanding of how ideas, events, or reasons are linked throughout a text using a variety of connecting words or phrases (e.g., for example, after that, suddenly) to comprehending and writing texts independently."
  },
  {
    "grade": "Grade 2",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 3,
    "title": "Using verbs and verb phrases",
    "emerging": "a. Use frequently used verbs (e.g., walk, run) and verb types (e.g., doing, saying, being/having, thinking/feeling) in shared language activities guided by the teacher and sometimes independently.<br>b. Use simple verb tenses appropriate to the text type and discipline to convey time (e.g., simple past tense for recounting an experience) in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "a. Use a growing number of verb types (e.g., doing, saying, being/having, thinking/feeling) with increasing independence.<br>b. Use a growing number of verb tenses appropriate to the text type and discipline to convey time (e.g., simple past tense for retelling, simple present for a science description) with increasing independence.",
    "bridging": "a. Use a variety of verb types (e.g., doing, saying, being/having, thinking/feeling) independently.<br>b. Use a wide variety of verb tenses appropriate to the text type and discipline to convey time (e.g., simple present tense for a science description, simple future to predict) independently."
  },
  {
    "grade": "Grade 2",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 4,
    "title": "Using nouns and noun phrases",
    "emerging": "Expand noun phrases in simple ways (e.g., adding a familiar adjective to describe a noun) in order to enrich the meaning of sentences and to add details about ideas, people, things, and the like, in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "Expand noun phrases in a growing number of ways (e.g., adding a newly learned adjective to a noun) in order to enrich the meaning of sentences and to add details about ideas, people, things, and the like, with increasing independence.",
    "bridging": "Expand noun phrases in a variety of ways (e.g., adding comparative/superlative adjectives to nouns) in order to enrich the meaning of phrases/sentences and to add details about ideas, people, things, and the like, independently."
  },
  {
    "grade": "Grade 2",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 5,
    "title": "Modifying to add details",
    "emerging": "Expand sentences with frequently used adverbials (e.g., prepositional phrases, such as at school, with my friend) to provide details (e.g., time, manner, place, cause) about a familiar activity or process in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "Expand sentences with a growing number of adverbials (e.g., adverbs, prepositional phrases) to provide details (e.g., time, manner, place, cause) about a familiar or new activity or process with increasing independence.",
    "bridging": "Expand sentences with a variety of adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause) independently."
  },
  {
    "grade": "Grade 2",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 6,
    "title": "Connecting ideas",
    "emerging": "Combine clauses in a few basic ways to make connections between and to join ideas (e.g., creating compound sentences using and, but, so) in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "Combine clauses in an increasing variety of ways to make connections between and to join ideas, for example, to express cause/effect (e.g., She jumped because the dog barked) with increasing independence.",
    "bridging": "Combine clauses in a wide variety of ways (e.g., rearranging complete simple to form compound sentences) to make connections between and to join ideas (e.g., The boy was hungry. The boy ate a sandwich. -> The boy was hungry, so he ate a sandwich) independently."
  },
  {
    "grade": "Grade 2",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 7,
    "title": "Condensing ideas",
    "emerging": "Condense clauses in simple ways (e.g., changing: It's green. It's red. -> It's green and red) to create precise and detailed sentences in shared language activities guided by the teacher and sometimes independently.",
    "expanding": "Condense clauses in a growing number of ways (e.g., through embedded clauses as in, It's a plant. It's found in the rain forest. -> It's a green and red plant that's found in the rain forest) to create precise and detailed sentences with increasing independence.",
    "bridging": "Condense clauses in a variety of ways (e.g., through embedded clauses and other condensing as in, It's a plant. It's green and red. It's found in the tropical rain forest. -> It's a green and red plant that's found in the tropical rain forest) to create precise and detailed sentences independently."
  },
  {
    "grade": "Grade 3",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 1,
    "title": "Exchanging information and ideas",
    "ccss_ela": "SL.3.1, 6; L.3.1, 3, 6",
    "emerging": "Contribute to conversations and express ideas by asking and answering yes-no and wh- questions and responding using short phrases.",
    "expanding": "Contribute to class, group, and partner discussions, including sustained dialogue, by following turn-taking rules, asking relevant questions, affirming others, and adding relevant information.",
    "bridging": "Contribute to class, group, and partner discussions, including sustained dialogue, by following turn-taking rules, asking relevant questions, affirming others, adding relevant information, building on responses, and providing useful feedback."
  },
  {
    "grade": "Grade 3",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 2,
    "title": "Interacting via written English",
    "ccss_ela": "W.3.6; L.3.1, 3, 6",
    "emerging": "Collaborate with peers on joint writing projects of short informational and literary texts, using technology where appropriate for publishing, graphics, and the like.",
    "expanding": "Collaborate with peers on joint writing projects of longer informational and literary texts, using technology where appropriate for publishing, graphics, and the like.",
    "bridging": "Collaborate with peers on joint writing projects of a variety of longer informational and literary texts, using technology where appropriate for publishing, graphics, and the like."
  },
  {
    "grade": "Grade 3",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 3,
    "title": "Offering opinions",
    "ccss_ela": "SL.3.1, 6; L.3.1, 3, 6",
    "emerging": "Offer opinions and negotiate with others in conversations using basic learned phrases (e.g., I think...), as well as open responses in order to gain and/or hold the floor.",
    "expanding": "Offer opinions and negotiate with others in conversations using an expanded set of learned phrases (e.g., I agree with X, and ...), as well as open responses in order to gain and/or hold the floor, provide counterarguments, and the like.",
    "bridging": "Offer opinions and negotiate with others in conversations using a variety of learned phrases (e.g., That's a good idea, but...), as well as open responses in order to gain and/or hold the floor, provide counterarguments, elaborate on an idea, and the like."
  },
  {
    "grade": "Grade 3",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 4,
    "title": "Adapting language choices",
    "ccss_ela": "W.3.4-5; SL.3.1, 6; L.3.1, 3, 6",
    "emerging": "Recognize that language choices (e.g., vocabulary) vary according to social setting (e.g., playground versus classroom), with substantial support from peers or adults.",
    "expanding": "Adjust language choices (e.g., vocabulary, use of dialogue, and the like) according to purpose (e.g., persuading, entertaining), social setting, and audience (e.g., peers versus adults), with moderate support from peers or adults.",
    "bridging": "Adjust language choices according to purpose (e.g., persuading, entertaining), task, and audience (e.g., peer-to-peer versus peer-to-teacher), with light support from peers or adults."
  },
  {
    "grade": "Grade 3",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 5,
    "title": "Listening actively",
    "ccss_ela": "SL.3.1-3; L.3.3",
    "emerging": "Demonstrate active listening to read-alouds and oral presentations by asking and answering basic questions, with prompting and substantial support.",
    "expanding": "Demonstrate active listening to read-alouds and oral presentations by asking and answering detailed questions, with occasional prompting and moderate support.",
    "bridging": "Demonstrate active listening to read-alouds and oral presentations by asking and answering detailed questions, with minimal prompting and light support."
  },
  {
    "grade": "Grade 3",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 6,
    "title": "Reading/viewing closely",
    "ccss_ela": "RL.3.1-7, 9-10; RI.3.1-7, 9-10; SL.3.2-3; L.3.3, 4, 6",
    "emerging": "Describe ideas, phenomena (e.g., how cows digest food), and text elements (e.g., main idea, characters, events) based on understanding of a select set of grade-level texts and viewing of multimedia, with substantial support.",
    "expanding": "Describe ideas, phenomena (e.g., insect metamorphosis), and text elements (e.g., main idea, characters, events) in greater detail based on understanding of a variety of grade-level texts and viewing of multimedia, with moderate support.",
    "bridging": "Describe ideas, phenomena (e.g., volcanic eruptions), and text elements (e.g., central message, character traits, major events) using key details based on understanding of a variety of grade-level texts and viewing of multimedia, with light support."
  },
  {
    "grade": "Grade 3",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 7,
    "title": "Evaluating language choices",
    "ccss_ela": "RL.3.3-4, 6; RI.3.2, 6, 8; SL.3.3; L.3.3-6",
    "emerging": "Describe the specific language writers or speakers use to present or support an idea (e.g., the specific vocabulary or phrasing used to provide evidence), with prompting and substantial support.",
    "expanding": "Describe the language writers or speakers use to support an opinion or present an idea (e.g., by identifying the phrases or words in the text that provide evidence), with prompting and moderate support.",
    "bridging": "Describe how well writers or speakers use specific language resources to support an opinion or present an idea (e.g., whether the vocabulary or phrasing used to provide evidence is strong enough), with light support."
  },
  {
    "grade": "Grade 3",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 8,
    "title": "Analyzing language choices",
    "ccss_ela": "RL.3.4-5; RI.3.4-5; SL.3.3; L.3.3-6",
    "emerging": "Distinguish how different words produce different effects on the audience (e.g., describing a character as happy versus sad).",
    "expanding": "Distinguish how different words with similar meanings (e.g., describing a character as happy versus ecstatic) produce shades of meaning and different effects on the audience.",
    "bridging": "Distinguish how multiple different words with similar meanings (e.g., pleased versus happy versus ecstatic, heard versus knew versus believed) produce shades of meaning and different effects on the audience."
  },
  {
    "grade": "Grade 3",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 9,
    "title": "Presenting",
    "ccss_ela": "SL.3.4-6; L.3.1, 3, 6",
    "emerging": "Plan and deliver very brief oral presentations (e.g., retelling a story, describing an animal, and the like).",
    "expanding": "Plan and deliver brief oral presentations on a variety of topics and content areas (e.g., retelling a story, explaining a science process, and the like).",
    "bridging": "Plan and deliver longer oral presentations on a variety of topics and content areas (e.g., retelling a story, explaining a science process or historical event, and the like)."
  },
  {
    "grade": "Grade 3",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 10,
    "title": "Writing",
    "ccss_ela": "W.3.1-8, 10; L.3.1-3, 6",
    "emerging": "a. Write short literary and informational texts (e.g., a description of a flashlight) collaboratively (e.g., joint construction of texts with an adult or with peers) and sometimes independently.<br>b. Paraphrase texts and recount experiences using key words from notes or graphic organizers.",
    "expanding": "a. Write longer literary and informational texts (e.g., an explanatory text on how flashlights work) collaboratively (e.g., joint construction of texts with an adult or with peers) and with increasing independence using appropriate text organization.<br>b. Paraphrase texts and recount experiences using complete sentences and key words from notes or graphic organizers.",
    "bridging": "a. Write longer and more detailed literary and informational texts (e.g., an explanatory text on how flashlights work) collaboratively (e.g., joint construction of texts with an adult or with peers) and independently using appropriate text organization and growing understanding of register.<br>b. Paraphrase texts and recount experiences using increasingly detailed complete sentences and key words from notes or graphic organizers."
  },
  {
    "grade": "Grade 3",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 11,
    "title": "Supporting opinions",
    "ccss_ela": "W.3.1, 4, 10; SL.3.4, 6; L.3.1-3, 6",
    "emerging": "Support opinions by providing good reasons and some textual evidence or relevant background knowledge (e.g., referring to textual evidence or knowledge of content).",
    "expanding": "Support opinions by providing good reasons and increasingly detailed textual evidence (e.g., providing examples from the text) or relevant background knowledge about the content.",
    "bridging": "Support opinions or persuade others by providing good reasons and detailed textual evidence (e.g., specific events or graphics from text) or relevant background knowledge about the content."
  },
  {
    "grade": "Grade 3",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 12,
    "title": "Selecting language resources",
    "ccss_ela": "W.3.4-5; SL.3.4, 6; L.3.1, 3, 5-6",
    "emerging": "Use a select number of general academic and domain-specific words to add detail (e.g., adding the word dangerous to describe a place, using the word habitat when describing animal behavior) while speaking and writing.",
    "expanding": "Use a growing number of general academic and domain-specific words in order to add detail, create an effect (e.g., using the word suddenly to signal a change), or create shades of meaning (e.g., scurry versus dash) while speaking and writing.",
    "bridging": "Use a wide variety of general academic and domain-specific words, synonyms, antonyms, and non-literal language to create an effect, precision, and shades of meaning while speaking and writing."
  },
  {
    "grade": "Grade 3",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 1,
    "title": "Understanding text structure",
    "ccss_ela": "RL.3.5; RI.3.5; W.3.1-5; SL.3.4",
    "emerging": "Apply understanding of how different text types are organized to express ideas (e.g., how a story is organized sequentially) to comprehending texts and writing basic texts.",
    "expanding": "Apply understanding of how different text types are organized to express ideas (e.g., how a story is organized sequentially with predictable stages) to comprehending texts and writing texts with increasing cohesion.",
    "bridging": "Apply understanding of how different text types are organized to express ideas (e.g., how a story is organized sequentially with predictable stages versus how opinion/arguments are structured logically, grouping related ideas) to comprehending texts and writing cohesive texts."
  },
  {
    "grade": "Grade 3",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 2,
    "title": "Understanding cohesion",
    "ccss_ela": "RL.3.5; RI.3.5; W.3.1-4; SL.3.4; L.3.1, 3",
    "emerging": "a. Apply basic understanding of language resources that refer the reader back or forward in text (e.g., how pronouns refer back to nouns in text) to comprehending texts and writing basic texts.<br>b. Apply basic understanding of how ideas, events, or reasons are linked throughout a text using everyday connecting words or phrases (e.g., then, next) to comprehending texts and writing basic texts.",
    "expanding": "a. Apply growing understanding of language resources that refer the reader back or forward in text (e.g., how pronouns refer back to nouns in text) to comprehending texts and writing texts with increasing cohesion.<br>b. Apply growing understanding of how ideas, events, or reasons are linked throughout a text using a variety of connecting words or phrases (e.g., at the beginning/end, first/next) to comprehending texts and writing texts with increasing cohesion.",
    "bridging": "a. Apply increasing understanding of language resources that refer the reader back or forward in text (e.g., how pronouns or synonyms refer back to nouns in text) to comprehending and writing cohesive texts.<br>b. Apply increasing understanding of how ideas, events, or reasons are linked throughout a text using an increasing variety of connecting and transitional words or phrases (e.g., for example, afterward, first/next/last) to comprehending texts and writing cohesive texts."
  },
  {
    "grade": "Grade 3",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 3,
    "title": "Using verbs and verb phrases",
    "ccss_ela": "W.3.5; SL.3.6; L.3.1, 3, 6",
    "emerging": "Use frequently used verbs, different verb types (e.g., doing, saying, being/having, thinking/feeling), and verb tenses appropriate to the text type and discipline to convey time (e.g., simple past for recounting an experience).",
    "expanding": "Use a growing number of verb types (e.g., doing, saying, being/having, thinking/feeling) and verb tenses appropriate to the text type and discipline to convey time (e.g., simple past for retelling, simple present for a science description).",
    "bridging": "Use a variety of verb types (e.g., doing, saying, being/having, thinking/feeling) and verb tenses appropriate to the text type and discipline to convey time (e.g., simple present for a science description, simple future to predict)."
  },
  {
    "grade": "Grade 3",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 4,
    "title": "Using nouns and noun phrases",
    "ccss_ela": "W.3.5; SL.3.6; L.3.1, 3, 6",
    "emerging": "Expand noun phrases in simple ways (e.g., adding an adjective to a noun) in order to enrich the meaning of sentences and add details about ideas, people, things, and the like.",
    "expanding": "Expand noun phrases in a growing number of ways (e.g., adding comparative/superlative adjectives to nouns) in order to enrich the meaning of sentences and add details about ideas, people, things, and the like.",
    "bridging": "Expand noun phrases in a variety of ways (e.g., adding comparative/superlative adjectives to noun phrases, simple clause embedding) in order to enrich the meaning of sentences and add details about ideas, people, things, and the like."
  },
  {
    "grade": "Grade 3",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 5,
    "title": "Modifying to add details",
    "ccss_ela": "W.3.5; SL.3.4, 6; L.3.1, 3, 6",
    "emerging": "Expand sentences with adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause, and the like) about a familiar activity or process (e.g., They walked to the soccer field).",
    "expanding": "Expand sentences with adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause, and the like) about a familiar or new activity or process (e.g., They worked quietly; they ran across the soccer field).",
    "bridging": "Expand sentences with adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause, and the like) about a range of familiar and new activities or processes (e.g., They worked quietly all night in their room)."
  },
  {
    "grade": "Grade 3",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 6,
    "title": "Connecting ideas",
    "ccss_ela": "W.3.1-3, 5; SL.3.4, 6; L.3.1, 3, 6",
    "emerging": "Combine clauses in a few basic ways to make connections between and join ideas (e.g., creating compound sentences using and, but, so).",
    "expanding": "Combine clauses in an increasing variety of ways (e.g., creating compound and complex sentences) to make connections between and join ideas, for example, to express cause/effect (e.g., The deer ran because the mountain lion came) or to make a concession (e.g., She studied all night even though she wasn't feeling well).",
    "bridging": "Combine clauses in a wide variety of ways (e.g., creating compound and complex sentences) to make connections between and join ideas, for example, to express cause/effect (e.g., The deer ran because the mountain lion approached them), to make a concession (e.g., She studied all night even though she wasn't feeling well), or to link two ideas that happen at the same time (e.g., The cubs played while their mother hunted)."
  },
  {
    "grade": "Grade 3",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 7,
    "title": "Condensing ideas",
    "ccss_ela": "W.3.1-3, 5; SL.3.4, 6; L.3.1, 3, 6",
    "emerging": "Condense clauses in simple ways (e.g., changing: It's green. It's red. -> It's green and red) to create precise and detailed sentences.",
    "expanding": "Condense clauses in a growing number of ways (e.g., through embedded clauses as in, It's a plant. It's found in the rain forest. -> It's a green and red plant that's found in the tropical rain forest) to create precise and detailed sentences.",
    "bridging": "Condense clauses in a variety of ways (e.g., through embedded clauses and other condensing as in, It's a plant. It's green and red. It's found in the tropical rain forest. -> It's a green and red plant that's found in the tropical rain forest) to create precise and detailed sentences."
  },
  {
    "grade": "Grade 4",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 1,
    "title": "Exchanging information and ideas",
    "ccss_ela": "SL.4.1, 6; L.4.1, 3, 6",
    "emerging": "Contribute to conversations and express ideas by asking and answering yes-no and wh- questions and responding using short phrases.",
    "expanding": "Contribute to class, group, and partner discussions, including sustained dialogue, by following turn-taking rules, asking relevant questions, affirming others, and adding relevant information.",
    "bridging": "Contribute to class, group, and partner discussions, including sustained dialogue, by following turn-taking rules, asking relevant questions, affirming others, adding relevant information, building on responses, and providing useful feedback."
  },
  {
    "grade": "Grade 4",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 2,
    "title": "Interacting via written English",
    "ccss_ela": "W.4.6; L.4.1, 3, 6",
    "emerging": "Collaborate with peers on joint writing projects of short informational and literary texts, using technology where appropriate for publishing, graphics, and the like.",
    "expanding": "Collaborate with peers on joint writing projects of longer informational and literary texts, using technology where appropriate for publishing, graphics, and the like.",
    "bridging": "Collaborate with peers on joint writing projects of a variety of longer informational and literary texts, using technology where appropriate for publishing, graphics, and the like."
  },
  {
    "grade": "Grade 4",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 3,
    "title": "Offering opinions",
    "ccss_ela": "SL.4.1, 6; L.4.1, 3, 6",
    "emerging": "Negotiate with or persuade others in conversations using basic learned phrases (e.g., I think...), as well as open responses, in order to gain and/or hold the floor.",
    "expanding": "Negotiate with or persuade others in conversations using an expanded set of learned phrases (e.g., I agree with X, but ...), as well as open responses, in order to gain and/or hold the floor, provide counterarguments, and so on.",
    "bridging": "Negotiate with or persuade others in conversations using a variety of learned phrases (e.g., That's a good idea. However...), as well as open responses, in order to gain and/or hold the floor, provide counterarguments, elaborate on an idea, and so on."
  },
  {
    "grade": "Grade 4",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 4,
    "title": "Adapting language choices",
    "ccss_ela": "W.4.4-5; SL.4.1, 6; L.4.1, 3, 6",
    "emerging": "Adjust language choices according to social setting (e.g., playground, classroom) and audience (e.g., peers, teacher), with substantial support.",
    "expanding": "Adjust language choices according to purpose (e.g., persuading, entertaining), task (e.g., telling a story versus explaining a science experiment), and audience, with moderate support.",
    "bridging": "Adjust language choices according to purpose, task (e.g., facilitating a science experiment), and audience, with light support."
  },
  {
    "grade": "Grade 4",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 5,
    "title": "Listening actively",
    "ccss_ela": "SL.4.1-3; L.4.3",
    "emerging": "Demonstrate active listening of read-alouds and oral presentations by asking and answering basic questions, with prompting and substantial support.",
    "expanding": "Demonstrate active listening of read-alouds and oral presentations by asking and answering detailed questions, with occasional prompting and moderate support.",
    "bridging": "Demonstrate active listening of read-alouds and oral presentations by asking and answering detailed questions, with minimal prompting and light support."
  },
  {
    "grade": "Grade 4",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 6,
    "title": "Reading/viewing closely",
    "ccss_ela": "RL.4.1-7, 9-10; RI.4.1-7, 9-10; SL.4.2-3; L.4.3, 4, 6",
    "emerging": "a. Describe ideas, phenomena (e.g., volcanic eruptions), and text elements (main idea, characters, events, and the like) based on close reading of a select set of grade-level texts, with substantial support.<br>b. Use knowledge of frequently used affixes (e.g., un-, mis-) and linguistic context, reference materials, and visual cues to determine the meaning of unknown words on familiar topics.",
    "expanding": "a. Describe ideas, phenomena (e.g., animal migration), and text elements (main idea, central message, and the like) in greater detail based on close reading of a variety of grade-level texts, with moderate support.<br>b. Use knowledge of morphology (e.g., affixes, roots, and base words), linguistic context, and reference materials to determine the meaning of unknown words on familiar topics.",
    "bridging": "a. Describe ideas, phenomena (e.g., pollination), and text elements (main idea, character traits, event sequence, and the like) in detail based on close reading of a variety of grade-level texts, with light support.<br>b. Use knowledge of morphology (e.g., affixes, roots, and base words) and linguistic context to determine the meaning of unknown and multiple-meaning words on familiar and new topics."
  },
  {
    "grade": "Grade 4",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 7,
    "title": "Evaluating language choices",
    "ccss_ela": "RL.4.3-4, 6; RI.4.2, 6, 8; SL.4.3; L.4.3-6",
    "emerging": "Describe the specific language writers or speakers use to present or support an idea (e.g., the specific vocabulary or phrasing used to provide evidence), with prompting and substantial support.",
    "expanding": "Describe how well writers or speakers use specific language resources to support an opinion or present an idea (e.g., whether the vocabulary or phrasing used to provide evidence is strong enough), with prompting and moderate support.",
    "bridging": "Describe how well writers and speakers use specific language resources to support an opinion or present an idea (e.g., the clarity or appealing nature of language used to present evidence), with prompting and light support."
  },
  {
    "grade": "Grade 4",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 8,
    "title": "Analyzing language choices",
    "ccss_ela": "RL.4.4-5; RI.4.4-5; SL.4.3; L.4.3-6",
    "emerging": "Distinguish how different words with similar meanings produce different effects on the audience (e.g., describing a character's actions as whined versus said).",
    "expanding": "Distinguish how different words with similar meanings (e.g., describing a character as smart versus an expert) and figurative language (e.g., as big as a whale) produce shades of meaning and different effects on the audience.",
    "bridging": "Distinguish how different words with related meanings (e.g., fun versus entertaining versus thrilling, possibly versus certainly) and figurative language produce shades of meaning and different effects on the audience."
  },
  {
    "grade": "Grade 4",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 9,
    "title": "Presenting",
    "ccss_ela": "SL.4.4-6; L.4.1, 3, 6",
    "emerging": "Plan and deliver brief oral presentations on a variety of topics and content areas (e.g., retelling a story, explaining a science process, reporting on a current event, recounting a memorable experience, and so on), with substantial support.",
    "expanding": "Plan and deliver longer oral presentations on a variety of topics and content areas (e.g., retelling a story, explaining a science process, reporting on a current event, recounting a memorable experience, and so on), with moderate support.",
    "bridging": "Plan and deliver oral presentations on a variety of topics in a variety of content areas (e.g., retelling a story, explaining a science process, reporting on a current event, recounting a memorable experience, and so on), with light support."
  },
  {
    "grade": "Grade 4",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 10,
    "title": "Writing",
    "ccss_ela": "W.4.1-10; L.4.1-3, 6",
    "emerging": "a. Write short literary and informational texts (e.g., a description of a flashlight) collaboratively (e.g., joint construction of texts with an adult or with peers) and sometimes independently.<br>b. Write brief summaries of texts and experiences using complete sentences and key words (e.g., from notes or graphic organizers).",
    "expanding": "a. Write longer literary and informational texts (e.g., an explanatory text on how flashlights work) collaboratively (e.g., joint construction of texts with an adult or with peers) and with increasing independence using appropriate text organization.<br>b. Write increasingly concise summaries of texts and experiences using complete sentences and key words (e.g., from notes or graphic organizers).",
    "bridging": "a. Write longer and more detailed literary and informational texts (e.g., an explanatory text on how flashlights work) collaboratively (e.g., joint construction of texts with an adult or with peers) and independently using appropriate text organization and growing understanding of register.<br>b. Write clear and coherent summaries of texts and experiences using complete and concise sentences and key words (e.g., from notes or graphic organizers)."
  },
  {
    "grade": "Grade 4",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 11,
    "title": "Supporting opinions",
    "ccss_ela": "W.4.1, 4, 9-10; SL.4.4, 6; L.4.1-3, 6",
    "emerging": "a. Support opinions by expressing appropriate/accurate reasons using textual evidence (e.g., referring to text) or relevant background knowledge about content, with substantial support.<br>b. Express ideas and opinions or temper statements using basic modal expressions (e.g., can, will, maybe).",
    "expanding": "a. Support opinions or persuade others by expressing appropriate/accurate reasons using some textual evidence (e.g., paraphrasing facts) or relevant background knowledge about content, with moderate support.<br>b. Express attitude and opinions or temper statements with familiar modal expressions (e.g., maybe/probably, can/must).",
    "bridging": "a. Support opinions or persuade others by expressing appropriate/accurate reasons using detailed textual evidence (e.g., quotations or specific events from text) or relevant background knowledge about content, with light support.<br>b. Express attitude and opinions or temper statements with nuanced modal expressions (e.g., probably/certainly, should/would) and phrasing (e.g., In my opinion...)."
  },
  {
    "grade": "Grade 4",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 12,
    "title": "Selecting language resources",
    "ccss_ela": "W.4.4-5; SL.4.4, 6; L.4.1, 3, 5-6",
    "emerging": "a. Use a select number of general academic and domain-specific words to create precision while speaking and writing.<br>b. Select a few frequently used affixes for accuracy and precision (e.g., She walks, I'm unhappy).",
    "expanding": "a. Use a growing number of general academic and domain-specific words, synonyms, and antonyms to create precision and shades of meaning while speaking and writing.<br>b. Select a growing number of frequently used affixes for accuracy and precision (e.g., She walked. He likes.... I'm unhappy).",
    "bridging": "a. Use a wide variety of general academic and domain-specific words, synonyms, antonyms, and figurative language to create precision and shades of meaning while speaking and writing.<br>b. Select a variety of appropriate affixes for accuracy and precision (e.g., She's walking. I'm uncomfortable. They left reluctantly)."
  },
  {
    "grade": "Grade 4",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 1,
    "title": "Understanding text structure",
    "ccss_ela": "RL.4.5; RI.4.5; W.4.1-5; SL.4.4",
    "emerging": "Apply understanding of how different text types are organized to express ideas (e.g., how a narrative is organized sequentially) to comprehending texts and writing basic texts.",
    "expanding": "Apply increasing understanding of how different text types are organized to express ideas (e.g., how a narrative is organized sequentially with predictable stages versus how an explanation is organized around ideas) to comprehending texts and writing texts with increasing cohesion.",
    "bridging": "Apply understanding of how different text types are organized to express ideas (e.g., how a narrative is organized sequentially with predictable stages versus how opinions/arguments are structured logically, grouping related ideas) to comprehending texts and writing cohesive texts."
  },
  {
    "grade": "Grade 4",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 2,
    "title": "Understanding cohesion",
    "ccss_ela": "RL.4.5; RI.4.5; W.4.1-4; SL.4.4; L.4.1, 3",
    "emerging": "a. Apply basic understanding of language resources for referring the reader back or forward in text (e.g., how pronouns refer back to nouns in text) to comprehending texts and writing basic texts.<br>b. Apply basic understanding of how ideas, events, or reasons are linked throughout a text using everyday connecting words or phrases (e.g., first, yesterday) to comprehending texts and writing basic texts.",
    "expanding": "a. Apply growing understanding of language resources for referring the reader back or forward in text (e.g., how pronouns or synonyms refer back to nouns in text) to comprehending texts and writing texts with increasing cohesion.<br>b. Apply growing understanding of how ideas, events, or reasons are linked throughout a text using a variety of connecting words or phrases (e.g., since, next, for example) to comprehending texts and writing texts with increasing cohesion.",
    "bridging": "a. Apply increasing understanding of language resources for referring the reader back or forward in text (e.g., how pronouns, synonyms, or nominalizations refer back to nouns in text) to comprehending texts and writing cohesive texts.<br>b. Apply increasing understanding of how ideas, events, or reasons are linked throughout a text using an increasing variety of academic connecting and transitional words or phrases (e.g., for instance, in addition, at the end) to comprehending texts and writing cohesive texts."
  },
  {
    "grade": "Grade 4",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 3,
    "title": "Using verbs and verb phrases",
    "ccss_ela": "W.4.5; SL.4.6; L.4.1, 3, 6",
    "emerging": "Use various verbs/verb types (e.g., doing, saying, being/having, thinking/feeling) and tenses appropriate to the text type and discipline (e.g., simple past for recounting an experience) for familiar topics.",
    "expanding": "Use various verbs/verb types (e.g., doing, saying, being/having, thinking/feeling) and tenses appropriate to the task, text type, and discipline (e.g., simple past for retelling, timeless present for science explanation) for an increasing variety of familiar and new topics.",
    "bridging": "Use various verbs/verb types (e.g., doing, saying, being/having, thinking/feeling) and tenses appropriate to the task and text type (e.g., timeless present for science explanation, mixture of past and present for historical information report) for a variety of familiar and new topics."
  },
  {
    "grade": "Grade 4",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 4,
    "title": "Using nouns and noun phrases",
    "ccss_ela": "W.4.5; SL.4.6; L.4.1, 3, 6",
    "emerging": "Expand noun phrases in simple ways (e.g., adding an adjective) in order to enrich the meaning of sentences and add details about ideas, people, things, and so on.",
    "expanding": "Expand noun phrases in a variety of ways (e.g., adding adjectives to noun phrases or simple clause embedding) in order to enrich the meaning of sentences and add details about ideas, people, things, and so on.",
    "bridging": "Expand noun phrases in an increasing variety of ways (e.g., adding general academic adjectives and adverbs to noun phrases or more complex clause embedding) in order to enrich the meaning of sentences and add details about ideas, people, things, and so on."
  },
  {
    "grade": "Grade 4",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 5,
    "title": "Modifying to add details",
    "ccss_ela": "W.4.5; SL.4.4, 6; L.4.1, 3, 6",
    "emerging": "Expand sentences with familiar adverbials (e.g., basic prepositional phrases) to provide details (e.g., time, manner, place, cause, and so on) about a familiar activity or process (e.g., They walked to the soccer field).",
    "expanding": "Expand sentences with a growing variety of adverbials (e.g., adverbs, prepositional phrases) to provide details (e.g., time, manner, place, cause, and so on) about a familiar or new activity or process (e.g., They worked quietly. They ran across the soccer field).",
    "bridging": "Expand sentences with a variety of adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause, and so on) about a variety of familiar and new activities and processes (e.g., They worked quietly all night in their room)."
  },
  {
    "grade": "Grade 4",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 6,
    "title": "Connecting ideas",
    "ccss_ela": "W.4.1-3, 5; SL.4.4, 6; L.4.1, 3, 6",
    "emerging": "Combine clauses in a few basic ways to make connections between and join ideas in sentences (e.g., creating compound sentences using coordinate conjunctions, such as and, but, so).",
    "expanding": "Combine clauses in an increasing variety of ways (e.g., creating complex sentences using familiar subordinate conjunctions) to make connections between and join ideas in sentences, for example, to express cause/effect (e.g., The deer ran because the mountain lion came) or to make a concession (e.g., She studied all night even though she wasn't feeling well).",
    "bridging": "Combine clauses in a wide variety of ways (e.g., creating complex sentences using a variety of subordinate conjunctions) to make connections between and join ideas, for example, to express cause/effect (e.g., Since the lion was at the waterhole, the deer ran away), to make a concession, or to link two ideas that happen at the same time (e.g., The cubs played while their mother hunted)."
  },
  {
    "grade": "Grade 4",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 7,
    "title": "Condensing ideas",
    "ccss_ela": "W.4.1-3, 5; SL.4.4, 6; L.4.1, 3, 6",
    "emerging": "Condense clauses in simple ways (e.g., through simple embedded clauses, as in, The woman is a doctor. She helps children. -> The woman is a doctor who helps children) to create precise and detailed sentences.",
    "expanding": "Condense clauses in an increasing variety of ways (e.g., through a growing number of embedded clauses and other condensing, as in, The dog ate quickly. The dog choked -> The dog ate so quickly that it choked) to create precise and detailed sentences.",
    "bridging": "Condense clauses in a variety of ways (e.g., through various types of embedded clauses and other ways of condensing as in, There was a Gold Rush. It began in the 1850s. It brought a lot of people to California. -> The Gold Rush that began in the 1850s brought a lot of people to California) to create precise and detailed sentences."
  },
  {
    "grade": "Grade 5",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 1,
    "title": "Exchanging information/ideas",
    "ccss_ela": "SL.5.1, 6; L.5.1, 3, 6",
    "emerging": "Contribute to conversations and express ideas by asking and answering yes-no and wh- questions and responding using short phrases.",
    "expanding": "Contribute to class, group, and partner discussions, including sustained dialogue, by following turn-taking rules, asking relevant questions, affirming others, and adding relevant information.",
    "bridging": "Contribute to class, group, and partner discussions, including sustained dialogue, by following turn-taking rules, asking relevant questions, affirming others, adding relevant information, building on responses, and providing useful feedback."
  },
  {
    "grade": "Grade 5",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 2,
    "title": "Interacting via written English",
    "ccss_ela": "W.5.6; L.5.1, 3, 6",
    "emerging": "Collaborate with peers on joint writing projects of short informational and literary texts, using technology where appropriate for publishing, graphics, and the like.",
    "expanding": "Collaborate with peers on joint writing projects of longer informational and literary texts, using technology where appropriate for publishing, graphics, and the like.",
    "bridging": "Collaborate with peers on joint writing projects of a variety of longer informational and literary texts, using technology where appropriate for publishing, graphics, and the like."
  },
  {
    "grade": "Grade 5",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 3,
    "title": "Offering opinions",
    "ccss_ela": "SL.5.1, 6; L.5.1, 3, 6",
    "emerging": "Negotiate with or persuade others in conversations using basic learned phrases (e.g., I think...), as well as open responses, in order to gain and/or hold the floor.",
    "expanding": "Negotiate with or persuade others in conversations using an expanded set of learned phrases (e.g., I agree with X, but ...), as well as open responses, in order to gain and/or hold the floor, provide counterarguments, and so on.",
    "bridging": "Negotiate with or persuade others in conversations using a variety of learned phrases (e.g., That's an interesting idea. However, ...), as well as open responses, in order to gain and/or hold the floor, provide counterarguments, elaborate on an idea, and so on."
  },
  {
    "grade": "Grade 5",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 4,
    "title": "Adapting language choices",
    "ccss_ela": "W.5.4-5; SL.5.1, 6; L.5.1, 3, 6",
    "emerging": "Adjust language choices according to social setting (e.g., playground, classroom) and audience (e.g., peers, teacher), with substantial support.",
    "expanding": "Adjust language choices according to purpose (e.g., persuading, entertaining), task (e.g., telling a story versus explaining a science experiment), and audience, with moderate support.",
    "bridging": "Adjust language choices according to purpose, task (e.g., facilitating a science experiment), and audience, with light support."
  },
  {
    "grade": "Grade 5",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 5,
    "title": "Listening actively",
    "ccss_ela": "SL.5.1-3; L.5.3",
    "emerging": "Demonstrate active listening of read-alouds and oral presentations by asking and answering basic questions, with prompting and substantial support.",
    "expanding": "Demonstrate active listening of read-alouds and oral presentations by asking and answering detailed questions, with occasional prompting and moderate support.",
    "bridging": "Demonstrate active listening of read-alouds and oral presentations by asking and answering detailed questions, with minimal prompting and light support."
  },
  {
    "grade": "Grade 5",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 6,
    "title": "Reading/viewing closely",
    "ccss_ela": "RL.5.1-7, 9-10; RI.5.1-7, 9-10; SL.5.2-3; L.5.3, 4, 6",
    "emerging": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, problem/solution) based on close reading of a variety of grade-level texts and viewing of multimedia, with substantial support.<br>b. Use knowledge of frequently used affixes (e.g., un-, mis-), linguistic context, reference materials, and visual cues to determine the meaning of unknown words on familiar topics.",
    "expanding": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, problem/solution) based on close reading of a variety of grade-level texts and viewing of multimedia, with moderate support.<br>b. Use knowledge of morphology (e.g., affixes, roots, and base words), linguistic context, and reference materials to determine the meaning of unknown words on familiar and new topics.",
    "bridging": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, problem/solution) based on close reading of a variety of grade-level texts and viewing of multimedia, with light support.<br>b. Use knowledge of morphology (e.g., affixes, roots, and base words), linguistic context, and reference materials to determine the meaning of unknown words on familiar and new topics."
  },
  {
    "grade": "Grade 5",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 7,
    "title": "Evaluating language choices",
    "ccss_ela": "RL.5.3-4, 6; RI.5.2, 6, 8; SL.5.3; L.5.3-6",
    "emerging": "Describe the specific language writers or speakers use to present or support an idea (e.g., the specific vocabulary or phrasing used to provide evidence), with prompting and substantial support.",
    "expanding": "Explain how well writers and speakers use language resources to support an opinion or present an idea (e.g., whether the vocabulary used to provide evidence is strong enough, or if the phrasing used to signal a shift in meaning does this well), with moderate support.",
    "bridging": "Explain how well writers and speakers use specific language resources to support an opinion or present an idea (e.g., the clarity or appealing nature of language used to provide evidence or describe characters, or if the phrasing used to introduce a topic is appropriate), with light support."
  },
  {
    "grade": "Grade 5",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 8,
    "title": "Analyzing language choices",
    "ccss_ela": "RL.5.4-5; RI.5.4-5; SL.5.3; L.5.3-6",
    "emerging": "Distinguish how different words with similar meanings produce different effects on the audience (e.g., describing a character as angry versus furious).",
    "expanding": "Distinguish how different words with similar meanings (e.g., describing an event as sad versus tragic) and figurative language (e.g., she ran like a cheetah) produce shades of meaning and different effects on the audience.",
    "bridging": "Distinguish how different words with related meanings (e.g., fun versus thrilling, possibly versus certainly) and figurative language (e.g., the stream slithered through the parched land) produce shades of meaning and different effects on the audience."
  },
  {
    "grade": "Grade 5",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 9,
    "title": "Presenting",
    "ccss_ela": "SL.5.4-6; L.5.1, 3, 6",
    "emerging": "Plan and deliver brief oral presentations on a variety of topics and content areas (e.g., providing a report on a current event, reciting a poem, recounting an experience, explaining a science process), with moderate support, such as graphic organizers.",
    "expanding": "Plan and deliver longer oral presentations on a variety of topics and content areas (e.g., providing an opinion speech on a current event, reciting a poem, recounting an experience, explaining a science process), with moderate support.",
    "bridging": "Plan and deliver oral presentations on a variety of topics in a variety of content areas (e.g., providing an opinion speech on a current event, reciting a poem, recounting an experience, explaining a science process), with light support."
  },
  {
    "grade": "Grade 5",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 10,
    "title": "Writing",
    "ccss_ela": "W.5.1-10; L.5.1-3, 6",
    "emerging": "a. Write short literary and informational texts (e.g., a description of a camel) collaboratively (e.g., joint construction of texts with an adult or with peers) and sometimes independently.<br>b. Write brief summaries of texts and experiences using complete sentences and key words (e.g., from notes or graphic organizers).",
    "expanding": "a. Write longer literary and informational texts (e.g., an informative report on different kinds of camels) collaboratively (e.g., joint construction of texts with an adult or with peers) and with increasing independence by using appropriate text organization.<br>b. Write increasingly concise summaries of texts and experiences using complete sentences and key words (e.g., from notes or graphic organizers).",
    "bridging": "a. Write longer and more detailed literary and informational texts (e.g., an explanation of how camels survive without water for a long time) collaboratively (e.g., joint construction of texts with an adult or with peers) and independently by using appropriate text organization and growing understanding of register.<br>b. Write clear and coherent summaries of texts and experiences using complete and concise sentences and key words (e.g., from notes or graphic organizers)."
  },
  {
    "grade": "Grade 5",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 11,
    "title": "Supporting opinions",
    "ccss_ela": "W.5.1, 4, 9-10; SL.5.4, 6; L.5.1-3, 6",
    "emerging": "a. Support opinions by expressing appropriate/accurate reasons using textual evidence (e.g., referring to text) or relevant background knowledge about content, with substantial support.<br>b. Express ideas and opinions or temper statements using basic modal expressions (e.g., can, has to, maybe).",
    "expanding": "a. Support opinions or persuade others by expressing appropriate/accurate reasons using some textual evidence (e.g., paraphrasing facts from a text) or relevant background knowledge about content, with moderate support.<br>b. Express attitude and opinions or temper statements with familiar modal expressions (e.g., maybe/probably, can/must).",
    "bridging": "a. Support opinions or persuade others by expressing appropriate/accurate reasons using detailed textual evidence (e.g., quoting the text directly or specific events from text) or relevant background knowledge about content, with mild support.<br>b. Express attitude and opinions or temper statements with nuanced modal expressions (e.g., probably/certainly, should/would) and phrasing (e.g., In my opinion...)."
  },
  {
    "grade": "Grade 5",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 12,
    "title": "Selecting language resources",
    "ccss_ela": "W.5.4-5; SL.5.4, 6; L.5.1, 3, 5-6",
    "emerging": "a. Use a select number of general academic and domain-specific words to create precision while speaking and writing.<br>b. Select a few frequently used affixes for accuracy and precision (e.g., She walks, I'm unhappy).",
    "expanding": "a. Use a growing number of general academic and domain-specific words, synonyms, and antonyms to create precision and shades of meaning while speaking and writing.<br>b. Select a growing number of frequently used affixes for accuracy and precision (e.g., She walked. He likes.... I'm unhappy).",
    "bridging": "a. Use a wide variety of general academic and domain-specific words, synonyms, antonyms, and figurative language to create precision and shades of meaning while speaking and writing.<br>b. Select a variety of appropriate affixes for accuracy and precision (e.g., She's walking. I'm uncomfortable. They left reluctantly)."
  },
  {
    "grade": "Grade 5",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 1,
    "title": "Understanding text structure",
    "ccss_ela": "RL.5.5; RI.5.5; W.5.1-5; SL.5.4",
    "emerging": "Apply basic understanding of how different text types are organized to express ideas (e.g., how a narrative is organized sequentially with predictable stages versus how opinions/arguments are organized around ideas) to comprehending texts and writing basic texts.",
    "expanding": "Apply growing understanding of how different text types are organized to express ideas (e.g., how a narrative is organized sequentially with predictable stages versus how opinions/arguments are structured logically around reasons and evidence) to comprehending texts and writing texts with increasing cohesion.",
    "bridging": "Apply increasing understanding of how different text types are organized to express ideas (e.g., how a historical account is organized chronologically versus how opinions/arguments are structured logically around reasons and evidence) to comprehending texts and writing cohesive texts."
  },
  {
    "grade": "Grade 5",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 2,
    "title": "Understanding cohesion",
    "ccss_ela": "RL.5.5; RI.5.5; W.5.1-4; SL.5.4; L.5.1, 3",
    "emerging": "a. Apply basic understanding of language resources for referring the reader back or forward in text (e.g., how pronouns refer back to nouns in text) to comprehending texts and writing basic texts.<br>b. Apply basic understanding of how ideas, events, or reasons are linked throughout a text using a select set of everyday connecting words or phrases (e.g., first/next, at the beginning) to comprehending texts and writing basic texts.",
    "expanding": "a. Apply growing understanding of language resources for referring the reader back or forward in text (e.g., how pronouns or synonyms refer back to nouns in text) to comprehending texts and writing texts with increasing cohesion.<br>b. Apply growing understanding of how ideas, events, or reasons are linked throughout a text using a variety of connecting words or phrases (e.g., for example, in the first place, as a result) to comprehending texts and writing texts with increasing cohesion.",
    "bridging": "a. Apply increasing understanding of language resources for referring the reader back or forward in text (e.g., how pronouns, synonyms, or nominalizations refer back to nouns in text) to comprehending texts and writing cohesive texts.<br>b. Apply increasing understanding of how ideas, events, or reasons are linked throughout a text using an increasing variety of academic connecting and transitional words or phrases (e.g., consequently, specifically, however) to comprehending texts and writing cohesive texts."
  },
  {
    "grade": "Grade 5",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 3,
    "title": "Using verbs and verb phrases",
    "ccss_ela": "W.5.5; SL.5.6; L.5.1, 3, 6",
    "emerging": "Use frequently used verbs (e.g., take, like, eat) and various verb types (e.g., doing, saying, being/having, thinking/feeling) and tenses appropriate to the text type and discipline (e.g., simple past for recounting an experience) on familiar topics.",
    "expanding": "Use various verb types (e.g., doing, saying, being/having, thinking/feeling) and tenses appropriate to the task, text type, and discipline (e.g., simple past for recounting an experience, timeless present for a science description) on an increasing variety of topics.",
    "bridging": "Use various verb types (e.g., doing, saying, being/having, thinking/feeling) and tenses appropriate to the task and text type (e.g., timeless present for science description, mixture of past and present for narrative or history explanation) on a variety of topics."
  },
  {
    "grade": "Grade 5",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 4,
    "title": "Using nouns and noun phrases",
    "ccss_ela": "W.5.5; SL.5.6; L.5.1, 3, 6",
    "emerging": "Expand noun phrases in simple ways (e.g., adding an adjective to a noun) in order to enrich the meaning of sentences and add details about ideas, people, things, and the like.",
    "expanding": "Expand noun phrases in a variety of ways (e.g., adding comparative/superlative adjectives to noun phrases or simple clause embedding) in order to enrich the meaning of sentences and add details about ideas, people, things, and the like.",
    "bridging": "Expand noun phrases in an increasing variety of ways (e.g., adding comparative/superlative and general academic adjectives to noun phrases or more complex clause embedding) in order to enrich the meaning of sentences and add details about ideas, people, things, and the like."
  },
  {
    "grade": "Grade 5",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 5,
    "title": "Modifying to add details",
    "ccss_ela": "W.5.5; SL.5.4, 6; L.5.1, 3, 6",
    "emerging": "Expand and enrich sentences with adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause, and the like) about a familiar activity or process.",
    "expanding": "Expand and enrich sentences with adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause, and the like) about a familiar or new activity or process.",
    "bridging": "Expand and enrich sentences with adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause, and the like) about a variety of familiar and new activities and processes."
  },
  {
    "grade": "Grade 5",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 6,
    "title": "Connecting ideas",
    "ccss_ela": "W.5.1-3, 5; SL.5.4, 6; L.5.1, 3, 6",
    "emerging": "Combine clauses in a few basic ways to make connections between and join ideas (e.g., You must X because X) or to provide evidence to support ideas or opinions (e.g., creating compound sentences using and, but, so).",
    "expanding": "Combine clauses in an increasing variety of ways (e.g., creating compound and complex sentences) to make connections between and join ideas, for example, to express cause/effect (e.g., The deer ran because the mountain lion came), to make a concession (e.g., She studied all night even though she wasn't feeling well), or to provide reasons to support ideas (e.g., X is an extremely good book because...).",
    "bridging": "Combine clauses in a wide variety of ways (e.g., creating compound and complex sentences) to make connections between and join ideas, for example, to express cause/effect (e.g., The deer ran because the mountain lion approached them), to make a concession (e.g., She studied all night even though she wasn't feeling well), to link two ideas that happen at the same time (e.g., The cubs played while their mother hunted), or to provide reasons to support ideas (e.g., The author persuades the reader by...)."
  },
  {
    "grade": "Grade 5",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 7,
    "title": "Condensing ideas",
    "ccss_ela": "W.5.1-3, 5; SL.5.4, 6; L.5.1, 3, 6",
    "emerging": "Condense clauses in simple ways (e.g., through simple embedded clauses as in, The book is on the desk. The book is mine. -> The book that is on the desk is mine) to create precise and detailed sentences.",
    "expanding": "Condense clauses in an increasing variety of ways (e.g., through a growing number of types of embedded clauses and other condensing as in, The book is mine. The book is about science. The book is on the desk. -> The science book that's on the desk is mine) to create precise and detailed sentences.",
    "bridging": "Condense clauses in a variety of ways (e.g., through various types of embedded clauses and some nominalizations as in, They were a very strong army. They had a lot of enemies. They crushed their enemies because they were strong. -> Their strength helped them crush their numerous enemies) to create precise and detailed sentences."
  },
  {
    "grade": "Grade 6",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 1,
    "title": "Exchanging information/ideas",
    "ccss_ela": "SL.6.1, 6; L.6.3, 6",
    "emerging": "Engage in conversational exchanges and express ideas on familiar topics by asking and answering yes-no and wh- questions and responding using simple phrases.",
    "expanding": "Contribute to class, group, and partner discussions by following turn-taking rules, asking relevant questions, affirming others, adding relevant information, and paraphrasing key ideas.",
    "bridging": "Contribute to class, group, and partner discussions by following turn-taking rules, asking relevant questions, affirming others, adding relevant information and evidence, paraphrasing key ideas, building on responses, and providing useful feedback."
  },
  {
    "grade": "Grade 6",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 2,
    "title": "Interacting via written English",
    "ccss_ela": "W.6.6; WHST.6.6; SL.6.2; L.6.3, 6",
    "emerging": "Engage in short written exchanges with peers and collaborate on simple written texts on familiar topics, using technology when appropriate.",
    "expanding": "Engage in longer written exchanges with peers and collaborate on more detailed written texts on a variety of topics, using technology when appropriate.",
    "bridging": "Engage in extended written exchanges with peers and collaborate on complex written texts on a variety of topics, using technology when appropriate."
  },
  {
    "grade": "Grade 6",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 3,
    "title": "Supporting opinions and persuading others",
    "ccss_ela": "W.6.1; WHST.6.1; SL.6.1, 4, 6; L.6.3, 6",
    "emerging": "Negotiate with or persuade others in conversations (e.g., to gain and hold the floor or ask for clarification) using basic learned phrases (e.g., I think.... Would you please repeat that?), as well as open responses.",
    "expanding": "Negotiate with or persuade others in conversations (e.g., to provide counterarguments) using an expanded set of learned phrases (I agree with X, but ...), as well as open responses.",
    "bridging": "Negotiate with or persuade others in conversations using appropriate register (e.g., to reflect on multiple perspectives) using a variety of learned phrases, indirect reported speech (e.g., I heard you say X, and Gabriel just pointed out Y), as well as open responses."
  },
  {
    "grade": "Grade 6",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 4,
    "title": "Adapting language choices",
    "ccss_ela": "W.6.4-5; WHST.6.4-5; SL.6.6; L.6.1, 3, 6",
    "emerging": "Adjust language choices according to social setting (e.g., classroom, break time) and audience (e.g., peers, teacher).",
    "expanding": "Adjust language choices according to purpose (e.g., explaining, persuading, entertaining), task, and audience.",
    "bridging": "Adjust language choices according to task (e.g., facilitating a science experiment, providing peer feedback on a writing assignment), purpose, task, and audience."
  },
  {
    "grade": "Grade 6",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 5,
    "title": "Listening actively",
    "ccss_ela": "SL.6.1, 3, 6; L.6.1, 3, 6",
    "emerging": "Demonstrate active listening in oral presentation activities by asking and answering basic questions, with prompting and substantial support.",
    "expanding": "Demonstrate active listening in oral presentation activities by asking and answering detailed questions, with occasional prompting and moderate support.",
    "bridging": "Demonstrate active listening in oral presentation activities by asking and answering detailed questions, with minimal prompting and support."
  },
  {
    "grade": "Grade 6",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 6,
    "title": "Reading/viewing closely",
    "ccss_ela": "RL.6.1-7, 9-10; RI.6.1-10; RH.6.1-10; RST.6.1-10; SL.6.2; L.6.1, 3, 6",
    "emerging": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, problem/solution) based on close reading of a variety of grade-level texts and viewing of multimedia, with substantial support.<br>b. Express inferences and conclusions drawn based on close reading of grade-level texts and viewing of multimedia using some frequently used verbs (e.g., shows that, based on).<br>c. Use knowledge of morphology (e.g., affixes, roots, and base words), context, reference materials, and visual cues to determine the meaning of unknown and multiple-meaning words on familiar topics.",
    "expanding": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, problem/solution) based on close reading of a variety of grade-level texts and viewing of multimedia, with moderate support.<br>b. Express inferences and conclusions based on close reading of grade-level texts and viewing of multimedia using a variety of verbs (e.g., suggests that, leads to).<br>c. Use knowledge of morphology (e.g., affixes, roots, and base words), context, reference materials, and visual cues to determine the meaning of unknown and multiple-meaning words on familiar and new topics.",
    "bridging": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, problem/solution) based on close reading of a variety of grade-level texts and viewing of multimedia, with light support.<br>b. Express inferences and conclusions drawn based on close reading of grade-level texts and viewing of multimedia using a variety of precise academic verbs (e.g., indicates that, influences).<br>c. Use knowledge of morphology (e.g., affixes, roots, and base words), context, reference materials, and visual cues to determine the meaning, including figurative and connotative meanings, of unknown and multiple-meaning words on a variety of new topics."
  },
  {
    "grade": "Grade 6",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 7,
    "title": "Evaluating language choices",
    "ccss_ela": "RL.6.4-5; RI.6.4, 6, 8; RH.6.4-6, 8; RST.6.4-6, 8; SL.6.3; L.6.3, 5-6",
    "emerging": "Explain how well writers and speakers use language to support ideas and arguments with detailed evidence (e.g., identifying the precise vocabulary used to present evidence, or the phrasing used to signal a shift in meaning) when provided with substantial support.",
    "expanding": "Explain how well writers and speakers use specific language to present ideas or support arguments and provide detailed evidence (e.g., showing the clarity of the phrasing used to present an argument) with moderate support.",
    "bridging": "Explain how well writers and speakers use specific language resources to present ideas or support arguments and provide detailed evidence (e.g., identifying the specific language used to present ideas and claims that are well supported and distinguishing them from those that are not) with light support."
  },
  {
    "grade": "Grade 6",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 8,
    "title": "Analyzing language choices",
    "ccss_ela": "RL.6.4-5; RI.6.4-5; RH.6.4-5; RST.6.4-5; SL.6.3; L.6.3, 5-6",
    "emerging": "Explain how phrasing or different common words with similar meaning (e.g., choosing to use the word cheap versus the phrase a good saver) produce different effects on the audience.",
    "expanding": "Explain how phrasing, different words with similar meaning (e.g., describing a character as stingy versus economical), or figurative language (e.g., The room was like a dank cave, littered with food wrappers, soda cans, and piles of laundry) produce shades of meaning and different effects on the audience.",
    "bridging": "Explain how phrasing, different words with similar meaning (e.g., stingy, economical, frugal, thrifty), or figurative language (e.g., The room was depressed and gloomy. The room was like a dank cave, littered with food wrappers, soda cans, and piles of laundry) produce shades of meaning, nuances, and different effects on the audience."
  },
  {
    "grade": "Grade 6",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 9,
    "title": "Presenting",
    "ccss_ela": "SL.6.4-6; L.6.1, 3",
    "emerging": "Plan and deliver brief informative oral presentations on familiar topics.",
    "expanding": "Plan and deliver longer oral presentations on a variety of topics, using details and evidence to support ideas.",
    "bridging": "Plan and deliver longer oral presentations on a variety of topics in a variety of disciplines, using reasoning and evidence to support ideas, as well as growing understanding of register."
  },
  {
    "grade": "Grade 6",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 10,
    "title": "Writing",
    "ccss_ela": "W.6.1-10; WHST.6.1-2, 4-10; L.6.1-6",
    "emerging": "a. Write short literary and informational texts (e.g., an argument for protecting the rain forests) collaboratively (e.g., with peers) and independently.<br>b. Write brief summaries of texts and experiences using complete sentences and key words (e.g., from notes or graphic organizers).",
    "expanding": "a. Write longer literary and informational texts (e.g., an argument for protecting the rain forests) collaboratively (e.g., with peers) and independently using appropriate text organization.<br>b. Write increasingly concise summaries of texts and experiences using complete sentences and key words (e.g., from notes or graphic organizers).",
    "bridging": "a. Write longer and more detailed literary and informational texts (e.g., an argument for protecting the rain forests) collaboratively (e.g., with peers) and independently using appropriate text organization and growing understanding of register.<br>b. Write clear and coherent summaries of texts and experiences using complete and concise sentences and key words (e.g., from notes or graphic organizers)."
  },
  {
    "grade": "Grade 6",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 11,
    "title": "Justifying/arguing",
    "ccss_ela": "W.6.1, 8-9; WHST.6.1, 8-9; L.6.1-3, 6",
    "emerging": "a. Justify opinions by providing some textual evidence (e.g., quoting from the text) or relevant background knowledge, with substantial support.<br>b. Express attitude and opinions or temper statements with some basic modal expressions (e.g., can, has to).",
    "expanding": "a. Justify opinions or persuade others by providing relevant textual evidence (e.g., quoting from the text or referring to what the text says) or relevant background knowledge, with moderate support.<br>b. Express attitude and opinions or temper statements with a variety of familiar modal expressions (e.g., maybe/probably, can/could, must).",
    "bridging": "a. Justify opinions or persuade others by providing detailed and relevant textual evidence (e.g., quoting from the text directly or referring to specific textual evidence) or relevant background knowledge, with light support.<br>b. Express attitude and opinions or temper statements with nuanced modal expressions (e.g., probably/certainly/definitely, should/would, might) and phrasing (e.g., In my opinion...)."
  },
  {
    "grade": "Grade 6",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 12,
    "title": "Selecting language resources",
    "ccss_ela": "W.6.4-5; WHST.6.4-5; SL.6.4, 6; L.6.1, 3, 5-6",
    "emerging": "a. Use a select number of general academic words (e.g., author, chart) and domain-specific words (e.g., scene, cell, fraction) to create some precision while speaking and writing.<br>b. Use knowledge of morphology to appropriately select affixes in basic ways (e.g., She likes X).",
    "expanding": "a. Use a growing set of academic words (e.g., author, chart, global, affect), domain specific words (e.g., scene, setting, plot, point of view, fraction, cell membrane, democracy), synonyms, and antonyms to create precision and shades of meaning while speaking and writing.<br>b. Use knowledge of morphology to appropriately select affixes in a growing number of ways to manipulate language (e.g., She likes X. That's impossible).",
    "bridging": "a. Use an expanded set of general academic words (e.g., affect, evidence, demonstrate, reluctantly), domain-specific words (e.g., scene, setting, plot, point of view, fraction, cell membrane, democracy), synonyms, antonyms, and figurative language to create precision and shades of meaning while speaking and writing.<br>b. Use knowledge of morphology to appropriately select affixes in a variety of ways to manipulate language (e.g., changing observe -> observation, reluctant -> reluctantly, produce -> production, and so on)."
  },
  {
    "grade": "Grade 6",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 1,
    "title": "Understanding text structure",
    "ccss_ela": "RL.6.5; RI.6.5; RH.6.5; RST.6.5; W.6.1-5, 10; WHST.6.1-2, 4-5, 10; SL.6.4",
    "emerging": "Apply basic understanding of how different text types are organized to express ideas (e.g., how a narrative is organized sequentially with predictable stages versus how arguments are organized around ideas) to comprehending texts and writing basic texts.",
    "expanding": "Apply growing understanding of how different text types are organized to express ideas (e.g., how a narrative is organized sequentially with predictable stages versus how arguments are structured logically around reasons and evidence) to comprehending texts and writing texts with increasing cohesion.",
    "bridging": "Apply increasing understanding of how different text types are organized to express ideas (e.g., how a historical account is organized chronologically versus how arguments are structured logically around reasons and evidence) to comprehending texts and writing cohesive texts."
  },
  {
    "grade": "Grade 6",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 2,
    "title": "Understanding cohesion",
    "ccss_ela": "RI.6.5; RH.6.5; RST.6.5; W.6.1-5, 10; WHST.6.1-2, 4-5, 10; L.6.1, 3-6",
    "emerging": "a. Apply basic understanding of language resources for referring the reader back or forward in text (e.g., how pronouns refer back to nouns in text) to comprehending texts and writing basic texts.<br>b. Apply basic understanding of how ideas, events, or reasons are linked throughout a text using a select set of everyday connecting words or phrases (e.g., first/next, at the beginning) to comprehending texts and writing basic texts.",
    "expanding": "a. Apply growing understanding of language resources for referring the reader back or forward in text (e.g., how pronouns or synonyms refer back to nouns in text) to comprehending texts and writing texts with increasing cohesion.<br>b. Apply growing understanding of how ideas, events, or reasons are linked throughout a text using a variety of connecting words or phrases (e.g., for example, in the first place, as a result, on the other hand) to comprehending texts and writing texts with increasing cohesion.",
    "bridging": "a. Apply increasing understanding of language resources for referring the reader back or forward in text (e.g., how pronouns, synonyms, or nominalizations refer back to nouns in text) to comprehending texts and writing cohesive texts.<br>b. Apply increasing understanding of how ideas, events, or reasons are linked throughout a text using an increasing variety of academic connecting and transitional words or phrases (e.g., consequently, specifically, however, moreover) to comprehending texts and writing cohesive texts."
  },
  {
    "grade": "Grade 6",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 3,
    "title": "Using verbs and verb phrases",
    "ccss_ela": "W.6.5; WHST.6.5; SL.6.6; L.6.1, 3-6",
    "emerging": "Use a variety of verb types (e.g., doing, saying, being/having, thinking/feeling), tenses (e.g., present, past, future, simple, progressive) appropriate to the text type and discipline (e.g., simple past and past progressive for recounting an experience) on familiar topics.",
    "expanding": "Use various verb types (e.g., doing, saying, being/having, thinking/feeling, reporting), tenses (e.g., present, past, future, simple, progressive, perfect) appropriate to the task, text type, and discipline (e.g., simple present for literary analysis) on an increasing variety of topics.",
    "bridging": "Use various verb types (e.g., doing, saying, being/having, thinking/feeling, reporting), tenses (e.g., present, past, future, simple, progressive, perfect) appropriate to the task, text type, and discipline (e.g., the present perfect to describe previously made claims or conclusions) on a variety of topics."
  },
  {
    "grade": "Grade 6",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 4,
    "title": "Using nouns and noun phrases",
    "ccss_ela": "W.6.5; WHST.6.5; SL.6.6; L.6.1, 3-6",
    "emerging": "Expand noun phrases in simple ways (e.g., adding a sensory adjective to a noun) in order to enrich the meaning of sentences and add details about ideas, people, things, and the like.",
    "expanding": "Expand noun phrases in a variety of ways (e.g., adding comparative/superlative adjectives to noun phrases or simple clause embedding) in order to enrich the meaning of sentences and add details about ideas, people, things, and the like.",
    "bridging": "Expand noun phrases in an increasing variety of ways (e.g., adding comparative/superlative and general academic adjectives to noun phrases or more complex clause embedding) in order to enrich the meaning of sentences and add details about ideas, people, things, and the like."
  },
  {
    "grade": "Grade 6",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 5,
    "title": "Modifying to add details",
    "ccss_ela": "W.6.4-5; WHST.6.4-5; SL.6.6; L.6.1, 3-6",
    "emerging": "Expand sentences with simple adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause) about a familiar activity or process.",
    "expanding": "Expand sentences with an increasing variety of adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause) about a familiar or new activity or process.",
    "bridging": "Expand sentences with a variety of adverbials (e.g., adverbs, adverb phrases and clauses, prepositional phrases) to provide details (e.g., time, manner, place, cause) about a variety of familiar and new activities and processes."
  },
  {
    "grade": "Grade 6",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 6,
    "title": "Connecting ideas",
    "ccss_ela": "W.6.1-5; WHST.6.1-2, 4-5; SL.6.4, 6; L.6.1, 3-6",
    "emerging": "Combine clauses in a few basic ways to make connections between and join ideas (e.g., creating compound sentences using and, but, so).",
    "expanding": "Combine clauses in an increasing variety of ways (e.g., creating compound and complex sentences) to make connections between and join ideas, for example, to express a reason (e.g., He stayed at home on Sunday to study for Monday's exam) or to make a concession (e.g., She studied all night even though she wasn't feeling well).",
    "bridging": "Combine clauses in a wide variety of ways (e.g., creating compound and complex sentences) to make connections between and join ideas, for example, to express a reason (e.g., He stayed at home on Sunday because he had an exam on Monday), to make a concession (e.g., She studied all night even though she wasn't feeling well), or to link two ideas that happen at the same time (e.g., The students worked in groups while their teacher walked around the room)."
  },
  {
    "grade": "Grade 6",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 7,
    "title": "Condensing ideas",
    "ccss_ela": "W.6.1-5; WHST.6.1-2, 4-5; SL.6.4, 6; L.6.1, 3-6",
    "emerging": "Condense ideas in simple ways (e.g., by compounding verbs, adding prepositional phrases, or through simple embedded clauses or other ways of condensing as in, This is a story about a girl. The girl changed the world. -> This is a story about a girl who changed the world) to create precise and detailed sentences.",
    "expanding": "Condense ideas in an increasing variety of ways (e.g., through various types of embedded clauses and other ways of condensing, as in, Organic vegetables are food. They're made without chemical fertilizers. They're made without chemical insecticides. -> Organic vegetables are foods that are made without chemical fertilizers or insecticides) to create precise and detailed sentences.",
    "bridging": "Condense ideas in a variety of ways (e.g., through various types of embedded clauses, ways of condensing, and nominalization as in, They destroyed the rain forest. Lots of animals died. -> The destruction of the rain forest led to the death of many animals) to create precise and detailed sentences."
  },
  {
    "grade": "Grade 7",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 1,
    "title": "Exchanging information/ideas",
    "ccss_ela": "SL.7.1, 6; L.7.3, 6",
    "emerging": "Engage in conversational exchanges and express ideas on familiar topics by asking and answering yes-no and wh- questions and responding using simple phrases.",
    "expanding": "Contribute to class, group, and partner discussions by following turn-taking rules, asking relevant questions, affirming others, adding relevant information, and paraphrasing key ideas.",
    "bridging": "Contribute to class, group, and partner discussions by following turn-taking rules, asking relevant questions, affirming others, adding relevant information and evidence, paraphrasing key ideas, building on responses, and providing useful feedback."
  },
  {
    "grade": "Grade 7",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 2,
    "title": "Interacting via written English",
    "ccss_ela": "W.7.6; WHST.7.6; SL.7.2; L.7.3, 6",
    "emerging": "Engage in short written exchanges with peers and collaborate on simple written texts on familiar topics, using technology when appropriate.",
    "expanding": "Engage in longer written exchanges with peers and collaborate on more detailed written texts on a variety of topics, using technology when appropriate.",
    "bridging": "Engage in extended written exchanges with peers and collaborate on complex written texts on a variety of topics, using technology when appropriate."
  },
  {
    "grade": "Grade 7",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 3,
    "title": "Supporting opinions and persuading others",
    "ccss_ela": "W.7.1; WHST.7.1; SL.7.1, 4, 6; L.7.3, 6",
    "emerging": "Negotiate with or persuade others in conversations (e.g., to gain and hold the floor or ask for clarification) using learned phrases (e.g., I think..., Would you please repeat that?) and open responses.",
    "expanding": "Negotiate with or persuade others in conversations (e.g., to provide counterarguments) using learned phrases (I agree with X, but... ), and open responses.",
    "bridging": "Negotiate with or persuade others in conversations using appropriate register (e.g., to acknowledge new information) using a variety of learned phrases, indirect reported speech (e.g., I heard you say X, and I haven't thought about that before), and open responses."
  },
  {
    "grade": "Grade 7",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 4,
    "title": "Adapting language choices",
    "ccss_ela": "W.7.45; WHST.7.45; SL.7.6; L.7.1, 3, 6",
    "emerging": "Adjust language choices according to social setting (e.g., classroom, break time) and audience (e.g., peers, teacher).",
    "expanding": "Adjust language choices according to purpose (e.g., explaining, persuading, entertaining), task, and audience.",
    "bridging": "Adjust language choices according to task (e.g., facilitating a science experiment, providing peer feedback on a writing assignment), purpose, task, and audience."
  },
  {
    "grade": "Grade 7",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 5,
    "title": "Listening actively",
    "ccss_ela": "SL.7.1, 3, 6; L.7.1, 3, 6",
    "emerging": "Demonstrate active listening in oral presentation activities by asking and answering basic questions, with prompting and substantial support.",
    "expanding": "Demonstrate active listening in oral presentation activities by asking and answering detailed questions, with occasional prompting and moderate support.",
    "bridging": "Demonstrate active listening in oral presentation activities by asking and answering detailed questions, with minimal prompting and support."
  },
  {
    "grade": "Grade 7",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 6,
    "title": "Reading/viewing closely",
    "ccss_ela": "RL.7.17, 910; RI.7.110; RH.7.110; RST.7.110; SL.7.2; L.7.1, 3, 6",
    "emerging": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, problem/solution) based on close reading of a variety of grade-appropriate texts and viewing of multimedia, with substantial support.<br>b. Express inferences and conclusions drawn based on close reading of grade-appropriate texts and viewing of multimedia using some frequently used verbs (e.g., shows that, based on).<br>c. Use knowledge of morphology (e.g., affixes, roots, and base words), context, reference materials, and visual cues to determine the meaning of unknown and multiple-meaning words on familiar topics.",
    "expanding": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, problem/solution) based on close reading of a variety of grade-level texts and viewing of multimedia, with moderate support.<br>b. Express inferences and conclusions based on close reading of grade appropriate texts and viewing of multimedia using a variety of verbs (e.g., suggests that, leads to).<br>c. Use knowledge of morphology (e.g., affixes, roots, and base words), context, reference materials, and visual cues to determine the meaning of unknown and multiple-meaning words on familiar and new topics.",
    "bridging": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, problem/solution) based on close reading of a variety of grade-level texts and viewing of multimedia, with light support.<br>b. Express inferences and conclusions drawn based on close reading of grade level texts and viewing of multimedia using a variety of precise academic verbs (e.g., indicates that, influences).<br>c. Use knowledge of morphology (e.g., affixes, roots, and base words), context, reference materials, and visual cues to determine the meaning, including figurative and connotative meanings, of unknown and multiple-meaning words on a variety of new topics."
  },
  {
    "grade": "Grade 7",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 7,
    "title": "Evaluating language choices",
    "ccss_ela": "RL.7.45; RI.7.4, 6, 8; RH.7.46, 8; RST.7.46, 8; SL.7.3; L.7.3, 56",
    "emerging": "Explain how well writers and speakers use language to support ideas and arguments with detailed evidence (e.g., identifying the precise vocabulary used to present evidence, or the phrasing used to signal a shift in meaning) when provided with substantial support.",
    "expanding": "Explain how well writers and speakers use specific language to present ideas of support arguments and provide detailed evidence (e.g., showing the clarity of the phrasing used to present an argument) when provided with moderate support.",
    "bridging": "Explain how well writers and speakers use specific language resources to present ideas or support arguments and provide detailed evidence (e.g., identifying the specific language used to present ideas and claims that are well supported and distinguishing them from those that are not) when provided with light support."
  },
  {
    "grade": "Grade 7",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 8,
    "title": "Analyzing language choices",
    "ccss_ela": "RL.7.45; RI.7.45; RH.7.45; RST.7.45; SL.7.3; L.7.3, 56",
    "emerging": "Explain how phrasing or different common words with similar meaning (e.g., choosing to use the word polite versus good) produce different effects on the audience.",
    "expanding": "Explain how phrasing, different words with similar meaning (e.g., describing a character as diplomatic versus respectful) or figurative language (e.g., The wind blew through the valley like a furnace) produce shades of meaning and different effects on the audience.",
    "bridging": "Explain how phrasing, different words with similar meaning (e.g., refined, respectful, polite, diplomatic) or figurative language (e.g., The wind whispered through the night) produce shades of meaning, nuances, and different effects on the audience."
  },
  {
    "grade": "Grade 7",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 9,
    "title": "Presenting",
    "ccss_ela": "SL.7.46; L.7.1, 3",
    "emerging": "Plan and deliver brief informative oral presentations on familiar topics.",
    "expanding": "Plan and deliver longer oral presentations on a variety of topics, using details and evidence to support ideas.",
    "bridging": "Plan and deliver longer oral presentations on a variety of topics in a variety of disciplines, using reasoning and evidence to support ideas, as well as growing understanding of register."
  },
  {
    "grade": "Grade 7",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 10,
    "title": "Writing",
    "ccss_ela": "W.7.110; WHST.7.12, 410; L.7.16",
    "emerging": "a. Write short literary and informational texts (e.g., an argument for wearing school uniforms) collaboratively (e.g., with peers) and independently.<br>b. Write brief summaries of texts and experiences using complete sentences and key words (e.g., from notes or graphic organizers).",
    "expanding": "a. Write longer literary and informational texts (e.g., an argument for wearing school uniforms) collaboratively (e.g., with peers) and independently using appropriate text organization.<br>b. Write increasingly concise summaries of texts and experiences using complete sentences and key words (e.g., from notes or graphic organizers).",
    "bridging": "a. Write longer and more detailed literary and informational texts (e.g., an argument for wearing school uniforms) collaboratively (e.g., with peers) and independently using appropriate text organization and growing understanding of register.<br>b. Write clear and coherent summaries of texts and experiences using complete and concise sentences and key words (e.g., from notes or graphic organizers)."
  },
  {
    "grade": "Grade 7",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 11,
    "title": "Justifying/arguing",
    "ccss_ela": "W.7.1, 89; WHST.7.1, 89; L.7.13, 6",
    "emerging": "a. Justify opinions by providing some textual evidence or relevant background knowledge, with substantial support.<br>b. Express attitude and opinions or temper statements with familiar modal expressions (e.g., can, may).",
    "expanding": "a. Justify opinions or persuade others by providing relevant textual evidence or relevant background knowledge, with moderate support.<br>b. Express attitude and opinions or temper statements with a variety of familiar modal expressions (e.g., possibly/likely, could/would/should).",
    "bridging": "a. Justify opinions or persuade others by providing detailed and relevant textual evidence or relevant background knowledge, with light support.<br>b. Express attitude and opinions or temper statements with nuanced modal expressions (e.g., possibly/potentially/absolutely, should/might)."
  },
  {
    "grade": "Grade 7",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 12,
    "title": "Selecting language resources",
    "ccss_ela": "W.7.45; WHST.7.45; SL.7.4, 6; L.7.1, 3, 56",
    "emerging": "a. Use a select number of general academic words (e.g., cycle, alternative) and domain-specific words (e.g., scene, chapter, paragraph, cell) to create some precision while speaking and writing.<br>b. Use knowledge of morphology to appropriately select affixes in basic ways (e.g., She likes X. He walked to school).",
    "expanding": "a. Use a growing set of academic words (e.g., cycle, alternative, indicate, process), domain-specific words (e.g., scene, soliloquy, sonnet, friction, monarchy, fraction), synonyms, and antonyms to create precision and shades of meaning while speaking and writing.<br>b. Use knowledge of morphology to appropriately select affixes in a growing number of ways to manipulate language (e.g., She likes walking to school. That's impossible).",
    "bridging": "a. Use an expanded set of general academic words (e.g., cycle, alternative, indicate, process, emphasize, illustrate), domain-specific words (e.g., scene, soliloquy, sonnet, friction, monarchy, fraction), synonyms, antonyms, and figurative language to create precision and shades of meaning while speaking and writing.<br>b. Use knowledge of morphology to appropriately select affixes in a variety of ways to manipulate language (e.g., changing destroy -> destruction, probably -> probability, reluctant -> reluctantly)."
  },
  {
    "grade": "Grade 7",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 1,
    "title": "Understanding text structure",
    "ccss_ela": "RL.7.5; RI.7.5; RH.7.5; RST.7.5; W.7.15, 10; WHST.7.12, 45, 10; SL.7.4",
    "emerging": "Apply understanding of how different text types are organized to express ideas (e.g., how narratives are organized sequentially) to comprehending texts and to writing brief arguments, informative/explanatory texts, and narratives.",
    "expanding": "Apply understanding of the organizational features of different text types (e.g., how narratives are organized by an event sequence that unfolds naturally versus how arguments are organized around reasons and evidence) to comprehending texts and to writing increasingly clear and coherent arguments, informative/explanatory texts, and narratives.",
    "bridging": "Apply understanding of the organizational structure of different text types (e.g., how narratives are organized by an event sequence that unfolds naturally versus how arguments are organized around reasons and evidence) to comprehending texts and to writing clear and cohesive arguments, informative/explanatory texts, and narratives."
  },
  {
    "grade": "Grade 7",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 2,
    "title": "Understanding cohesion",
    "ccss_ela": "RI.7.5; RH.7.5; RST.7.5; W.7.15, 10; WHST.7.12, 45, 10; L.7.1, 36",
    "emerging": "a. Apply knowledge of familiar language resources for referring to make texts more cohesive (e.g., how pronouns refer back to nouns in text) to comprehending texts and writing brief texts.<br>b. Apply basic understanding of how ideas, events, or reasons are linked throughout a text using everyday connecting words or phrases (e.g., at the end, next) to comprehending texts and writing brief texts.",
    "expanding": "a. Apply growing understanding of language resources for referring the reader back or forward in text (e.g., how pronouns or synonyms refer back to nouns in text) to comprehending texts and writing texts with increasing cohesion.<br>b. Apply growing understanding of how ideas, events, or reasons are linked throughout a text using a variety of connecting words or phrases (e.g., for example, as a result, on the other hand) to comprehending texts and writing texts with increasing cohesion.",
    "bridging": "a. Apply increasing understanding of language resources for referring the reader back or forward in text (e.g., how pronouns, synonyms, or nominalizations refer back to nouns in text) to comprehending texts and writing cohesive texts.<br>b. Apply increasing understanding of how ideas, events, or reasons are linked throughout a text using an increasing variety of academic connecting and transitional words or phrases (e.g., consequently, specifically, however, moreover) to comprehending texts and writing cohesive texts."
  },
  {
    "grade": "Grade 7",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 3,
    "title": "Using verbs and verb phrases",
    "ccss_ela": "W.7.5; WHST.7.5; SL.7.6; L.7.1, 36",
    "emerging": "Use a variety of verb types (e.g., doing, saying, being/having, thinking/feeling), tenses (e.g., present, past, future, simple, progressive) appropriate to the text type and discipline (e.g., simple past and past progressive for recounting an experience) on familiar topics.",
    "expanding": "Use various verb types (e.g., doing, saying, being/having, thinking/feeling, reporting), tenses (e.g., present, past, future, simple, progressive, perfect) appropriate to the task, text type, and discipline (e.g., simple present for literary analysis) on an increasing variety of topics.",
    "bridging": "Use various verb types (e.g., doing, saying, being/having, thinking/feeling, reporting), tenses (e.g., present, past, future, simple, progressive, perfect) appropriate to the task, text type, and discipline (e.g., the present perfect to describe previously made claims or conclusions) on a variety of topics."
  },
  {
    "grade": "Grade 7",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 4,
    "title": "Using nouns and noun phrases",
    "ccss_ela": "W.7.5; WHST.7.5; SL.7.6; L.7.1, 36",
    "emerging": "Expand noun phrases in basic ways (e.g., adding a sensory adjective to a noun) in order to enrich the meaning of sentences and add details about ideas, people, and things.",
    "expanding": "Expand noun phrases in a growing number of ways (e.g., adding adjectives to nouns or simple clause embedding) in order to enrich the meaning of sentences and add details about ideas, people, and things.",
    "bridging": "Expand noun phrases in an increasing variety of ways (e.g., more complex clause embedding) in order to enrich the meaning of sentences and add details about ideas, people, and things."
  },
  {
    "grade": "Grade 7",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 5,
    "title": "Modifying to add details",
    "ccss_ela": "W.7.45; WHST.7.45; SL.7.6; L.7.1, 36",
    "emerging": "Expand sentences with simple adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause) about a familiar activity or process.",
    "expanding": "Expand sentences with an increasing variety of adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause) about a familiar or new activity or process.",
    "bridging": "Expand sentences with a variety of adverbials (e.g., adverbs, adverb phrases and clauses, prepositional phrases) to provide details (e.g., time, manner, place, cause) about a variety of familiar and new activities and processes."
  },
  {
    "grade": "Grade 7",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 6,
    "title": "Connecting ideas",
    "ccss_ela": "W.7.15; WHST.7.12, 4-5; SL.7.4, 6; L.7.1, 36",
    "emerging": "Combine clauses in a few basic ways to make connections between and join ideas (e.g., creating compound sentences using and, but, so; creating complex sentences using because).",
    "expanding": "Combine clauses in an increasing variety of ways (e.g., creating compound and complex sentences) to make connections between and join ideas, for example, to express a reason (e.g., He stayed at home on Sunday in order to study for Monday's exam) or to make a concession (e.g., She studied all night even though she wasn't feeling well).",
    "bridging": "Combine clauses in a wide variety of ways (e.g., creating compound and complex sentences) to make connections between and join ideas, for example, to express a reason (e.g., He stayed at home on Sunday because he had an exam on Monday), to make a concession (e.g., She studied all night even though she wasn't feeling well), or to link two ideas that happen at the same time (e.g., The students worked in groups while their teacher walked around the room)."
  },
  {
    "grade": "Grade 7",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 7,
    "title": "Condensing ideas",
    "ccss_ela": "W.7.15; WHST.7.12, 45; SL.7.4, 6; L.7.1, 36",
    "emerging": "Condense ideas in simple ways (e.g., by compounding verbs, adding prepositional phrases, or through simple embedded clauses or other ways of condensing as in, This is a story about a girl. The girl changed the world. -> This is a story about a girl who changed the world) to create precise and detailed sentences.",
    "expanding": "Condense ideas in an increasing variety of ways (e.g., through various types of embedded clauses and other ways of condensing, as in, Organic vegetables are food. They're made without chemical fertilizers. They're made without chemical insecticides -> Organic vegetables are foods that are made without chemical fertilizers or insecticides) to create precise and detailed sentences.",
    "bridging": "Condense ideas in a variety of ways (e.g., through various types of embedded clauses, ways of condensing, and nominalization as in, They destroyed the rain forest. Lots of animals died. -> The destruction of the rain forest led to the death of many animals) to create precise and detailed sentences."
  },
  {
    "grade": "Grade 8",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 1,
    "title": "Exchanging information/ideas",
    "ccss_ela": "SL.8.1, 6; L.8.3, 6",
    "emerging": "Engage in conversational exchanges and express ideas on familiar topics by asking and answering yes-no and wh- questions and responding using simple phrases.",
    "expanding": "Contribute to class, group, and partner discussions by following turn-taking rules, asking relevant questions, affirming others, adding relevant information, and paraphrasing key ideas.",
    "bridging": "Contribute to class, group, and partner discussions by following turn-taking rules, asking relevant questions, affirming others, adding relevant information and evidence, paraphrasing key ideas, building on responses, and providing useful feedback."
  },
  {
    "grade": "Grade 8",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 2,
    "title": "Interacting via written English",
    "ccss_ela": "W.8.6; WHST.8.6; SL.8.2; L.8.3, 6",
    "emerging": "Engage in short written exchanges with peers and collaborate on simple written texts on familiar topics, using technology when appropriate.",
    "expanding": "Engage in longer written exchanges with peers and collaborate on more detailed written texts on a variety of topics, using technology when appropriate.",
    "bridging": "Engage in extended written exchanges with peers and collaborate on complex written texts on a variety of topics, using technology when appropriate."
  },
  {
    "grade": "Grade 8",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 3,
    "title": "Supporting opinions and persuading others",
    "ccss_ela": "W.8.1; WHST.8.1; SL.8.1, 4, 6; L.8.3, 6",
    "emerging": "Negotiate with or persuade others in conversations (e.g., to gain and hold the floor or to ask for clarification) using learned phrases (e.g., I think... Would you please repeat that?) and open responses.",
    "expanding": "Negotiate with or persuade others in conversations (e.g., to provide counterarguments) using learned phrases (I agree with X, but... ) and open responses.",
    "bridging": "Negotiate with or persuade others in conversations using an appropriate register (e.g., to acknowledge new information and justify views) using a variety of learned phrases, indirect reported speech (e.g., I heard you say X, and that's a good point. I still think Y, though, because... ) and open responses."
  },
  {
    "grade": "Grade 8",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 4,
    "title": "Adapting language choices",
    "ccss_ela": "W.8.45; WHST.8.45; SL.8.6; L.8.1, 3, 6",
    "emerging": "Adjust language choices according to social setting (e.g., classroom, break time) and audience (e.g., peers, teacher).",
    "expanding": "Adjust language choices according to task (e.g., facilitating a science experiment, providing peer feedback on a writing assignment), purpose, and audience.",
    "bridging": "Adjust language choices according to purpose (e.g., explaining, persuading, entertaining), task, and audience."
  },
  {
    "grade": "Grade 8",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 5,
    "title": "Listening actively",
    "ccss_ela": "SL.8.1, 3, 6; L.8.1, 3, 6",
    "emerging": "Demonstrate active listening in oral presentation activities by asking and answering basic questions, with prompting and substantial support.",
    "expanding": "Demonstrate active listening in oral presentation activities by asking and answering detailed questions, with occasional prompting and moderate support.",
    "bridging": "Demonstrate active listening in oral presentation activities by asking and answering detailed questions, with minimal prompting and support."
  },
  {
    "grade": "Grade 8",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 6,
    "title": "Reading/viewing closely",
    "ccss_ela": "RL.8.17, 910; RI.8.110; RH.8.110; RST.8.110; SL.8.2; L.8.1, 3, 6",
    "emerging": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, problem/solution) based on close reading of a variety of grade-appropriate texts and viewing of multimedia, with substantial support.<br>b. Express inferences and conclusions drawn based on close reading of grade-appropriate texts and viewing of multimedia using some frequently used verbs (e.g., shows that, based on).<br>c. Use knowledge of morphology (e.g., affixes, roots, and base words), context, reference materials, and visual cues to determine the meanings of unknown and multiple-meaning words on familiar topics.",
    "expanding": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, problem/solution) based on close reading of a variety of grade-appropriate texts and viewing of multimedia, with moderate support.<br>b. Express inferences and conclusions based on close reading grade appropriate texts and viewing of multimedia using a variety of verbs (e.g., suggests that, leads to).<br>c. Use knowledge of morphology (e.g., affixes, roots, and base words), context, reference materials, and visual cues to determine the meanings of unknown and multiple-meaning words on familiar and new topics.",
    "bridging": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, problem/solution) based on close reading of a variety of grade-level texts and viewing of multimedia, with light support.<br>b. Express inferences and conclusions drawn based on close reading of grade level texts and viewing of multimedia using a variety of precise academic verbs (e.g., indicates that, influences).<br>c. Use knowledge of morphology (e.g., affixes, roots, and base words), context, reference materials, and visual cues to determine the meanings, including figurative and connotative meanings, of unknown and multiple-meaning words on a variety of new topics."
  },
  {
    "grade": "Grade 8",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 7,
    "title": "Evaluating language choices",
    "ccss_ela": "RL.8.45; RI.8.4, 6, 8; RH.8.46, 8; RST.8.46, 8; SL.8.3; L.8.3, 56",
    "emerging": "Explain how well writers and speakers use language to support ideas and arguments with detailed evidence (e.g., identifying the precise vocabulary used to present evidence, or the phrasing used to signal a shift in meaning) when provided with substantial support.",
    "expanding": "Explain how well writers and speakers use specific language to present ideas or support arguments and provide detailed evidence (e.g., showing the clarity of the phrasing used to present an argument) when provided with moderate support.",
    "bridging": "Explain how well writers and speakers use specific language resources to present ideas or support arguments and provide detailed evidence (e.g., identifying the specific language used to present ideas and claims that are well supported and distinguishing them from those that are not) when provided with light support."
  },
  {
    "grade": "Grade 8",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 8,
    "title": "Analyzing language choices",
    "ccss_ela": "RL.8.45; RI.8.45; RH.8.45; RST.8.45; SL.8.3; L.8.3, 56",
    "emerging": "Explain how phrasing or different common words with similar meanings (e.g., choosing to use the word persistent versus the term hard worker) produce different effects on the audience.",
    "expanding": "Explain how phrasing or different words with similar meanings (e.g., describing a character as stubborn versus persistent) or figurative language (e.g., Let me throw some light onto the topic) produce shades of meaning and different effects on the audience.",
    "bridging": "Explain how phrasing or different words with similar meanings (e.g., cunning versus smart, stammer versus say) or figurative language (e.g., Let me throw some light onto the topic) produce shades of meaning, nuances, and different effects on the audience."
  },
  {
    "grade": "Grade 8",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 9,
    "title": "Presenting",
    "ccss_ela": "SL.8.46; L.8.1, 3",
    "emerging": "Plan and deliver brief informative oral presentations on concrete topics.",
    "expanding": "Plan and deliver longer oral presentations on a variety of topics using details and evidence to support ideas.",
    "bridging": "Plan and deliver longer oral presentations on a variety of concrete and abstract topics using reasoning and evidence to support ideas and using a growing understanding of register."
  },
  {
    "grade": "Grade 8",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 10,
    "title": "Writing",
    "ccss_ela": "W.8.110; WHST.8.12, 410; L.8.16",
    "emerging": "a. Write short literary and informational texts (e.g., an argument about whether the government should fund research using stem cells) collaboratively (e.g., with peers) and independently.<br>b. Write brief summaries of texts and experiences using complete sentences and key words (e.g., from notes or graphic organizers).",
    "expanding": "a. Write longer literary and informational texts (e.g., an argument about whether the government should fund research using stem cells) collaboratively (e.g., with peers) and independently using appropriate text organization.<br>b. Write increasingly concise summaries of texts and experiences using complete sentences and key words (e.g., from notes or graphic organizers).",
    "bridging": "a. Write longer and more detailed literary and informational texts (e.g., an argument about whether the government should fund research using stem cells) collaboratively (e.g., with peers) and independently using appropriate text organization and growing understanding of register.<br>b. Write clear and coherent summaries of texts and experiences using complete and concise sentences and key words (e.g., from notes or graphic organizers)."
  },
  {
    "grade": "Grade 8",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 11,
    "title": "Justifying/arguing",
    "ccss_ela": "W.8.1, 89; WHST.8.1, 89; L.8.13, 6",
    "emerging": "a. Justify opinions by providing some textual evidence or relevant background knowledge, with substantial support.<br>b. Express attitude and opinions or temper statements with familiar modal expressions (e.g., can, may).",
    "expanding": "a. Justify opinions or persuade others by providing relevant textual evidence or relevant background knowledge, with moderate support.<br>b. Express attitude and opinions or temper statements with a variety of familiar modal expressions (e.g., possibly/likely, could/would).",
    "bridging": "a. Justify opinions or persuade others by providing detailed and relevant textual evidence or relevant background knowledge, with light support.<br>b. Express attitude and opinions or temper statements with nuanced modal expressions (e.g., potentially/certainly/absolutely, should/might)."
  },
  {
    "grade": "Grade 8",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 12,
    "title": "Selecting language resources",
    "ccss_ela": "W.8.45; WHST.8.45; SL.8.4, 6; L.8.1, 3, 56",
    "emerging": "a. Use a select number of general academic words (e.g., specific, contrast) and domain-specific words (e.g., scene, cell, fraction) to create some precision while speaking and writing.<br>b. Use knowledge of morphology to appropriately select affixes in basic ways (e.g., She likes X. He walked to school).",
    "expanding": "a. Use a growing set of academic words (e.g., specific, contrast, significant, function), domain-specific words (e.g., scene, irony, suspense, analogy, cell membrane, fraction), synonyms, and antonyms to create precision and shades of meaning while speaking and writing.<br>b. Use knowledge of morphology to appropriately select affixes in a growing number of ways to manipulate language (e.g., She likes walking to school. That's impossible).",
    "bridging": "a. Use an expanded set of general academic words (e.g., specific, contrast, significant, function, adequate, analysis), domain-specific words (e.g., scene, irony, suspense, analogy, cell membrane, fraction), synonyms, antonyms, and figurative language to create precision and shades of meaning while speaking and writing.<br>b. Use knowledge of morphology to appropriately select affixes in a variety of ways to manipulate language (e.g., changing destroy -> destruction, probably -> probability, reluctant -> reluctantly)."
  },
  {
    "grade": "Grade 8",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 1,
    "title": "Understanding text structure",
    "ccss_ela": "RL.8.5; RI.8.5; RH.8.5; RST.8.5; W.8.15, 10; WHST.8.12, 45, 10; SL.8.4",
    "emerging": "Apply understanding of how different text types are organized to express ideas (e.g., how narratives are organized sequentially) to comprehending texts and to writing brief arguments, informative/explanatory texts, and narratives.",
    "expanding": "Apply understanding of the organizational features of different text types (e.g., how narratives are organized by an event sequence that unfolds naturally versus how arguments are organized around reasons and evidence) to comprehending texts and to writing increasingly clear and coherent arguments, informative/explanatory texts, and narratives.",
    "bridging": "Apply understanding of the organizational structure of different text types (e.g., how narratives are organized by an event sequence that unfolds naturally versus how arguments are organized around reasons and evidence) to comprehending texts and to writing clear and cohesive arguments, informative/explanatory texts, and narratives."
  },
  {
    "grade": "Grade 8",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 2,
    "title": "Understanding cohesion",
    "ccss_ela": "RI.8.5; RH.8.5; RST.8.5; W.8.15, 10; WHST.8.12, 45, 10; L.8.1, 36",
    "emerging": "a. Apply knowledge of familiar language resources for referring to make texts more cohesive (e.g., how pronouns refer back to nouns in text) to comprehending and writing brief texts.<br>b. Apply basic understanding of how ideas, events, or reasons are linked throughout a text using everyday connecting words or phrases (e.g., at the end, next) to comprehending and writing brief texts.",
    "expanding": "a. Apply knowledge of familiar language resources for referring to make texts more cohesive (e.g., how pronouns refer back to nouns in text, how using synonyms helps avoid repetition) to comprehending and writing texts with increasing cohesion.<br>b. Apply growing understanding of how ideas, events, or reasons are linked throughout a text using a variety of connecting words or phrases (e.g., for example, as a result, on the other hand) to comprehending and writing texts with increasing cohesion.",
    "bridging": "a. Apply knowledge of familiar language resources for referring to make texts more cohesive (e.g., how pronouns, synonyms, or nominalizations are used to refer backward in a text) to comprehending texts and writing cohesive texts.<br>b. Apply increasing understanding of how ideas, events, or reasons are linked throughout a text using an increasing variety of academic connecting and transitional words or phrases (e.g., for instance, in addition, consequently) to comprehending and writing texts with increasing cohesion."
  },
  {
    "grade": "Grade 8",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 3,
    "title": "Using verbs and verb phrases",
    "ccss_ela": "W.8.5; WHST.8.5; SL.8.6; L.8.1, 36",
    "emerging": "Use a variety of verbs in different tenses (e.g., past, present, future, simple, progressive) appropriate to the text type and discipline (e.g., simple past and past progressive for recounting an experience) on familiar topics.",
    "expanding": "Use a variety of verbs in different tenses (e.g., past, present, future, simple, progressive, perfect) appropriate to the task, text type, and discipline (e.g., the present perfect to describe previously made claims or conclusions) on an increasing variety of topics.",
    "bridging": "Use a variety of verbs in different tenses (e.g., past, present, future, simple, progressive, perfect), voices (active and passive), and moods (e.g., declarative, interrogative, subjunctive) appropriate to the task, text type, and discipline (e.g., the passive voice in simple past to describe the methods of a scientific experiment) on a variety of topics."
  },
  {
    "grade": "Grade 8",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 4,
    "title": "Using nouns and noun phrases",
    "ccss_ela": "W.8.5; WHST.8.5; SL.8.6; L.8.1, 36",
    "emerging": "Expand noun phrases in basic ways (e.g., adding a sensory adjective to a noun) in order to enrich the meaning of sentences and add details about ideas, people, things, and so on.",
    "expanding": "Expand noun phrases in a growing number of ways (e.g., adding prepositional or adjective phrases) in order to enrich the meaning of sentences and add details about ideas, people, things, and so on.",
    "bridging": "Expand noun phrases in an increasing variety of ways (e.g., embedding relative or complement clauses) in order to enrich the meaning of sentences and add details about ideas, people, things, and so on."
  },
  {
    "grade": "Grade 8",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 5,
    "title": "Modifying to add details",
    "ccss_ela": "W.8.45; WHST.8.45; SL.8.6; L.8.1, 36",
    "emerging": "Expand sentences with simple adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause) about a familiar activity or process.",
    "expanding": "Expand sentences with adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause) about a familiar or new activity or process.",
    "bridging": "Expand sentences with increasingly complex adverbials (e.g., adverbs, adverb phrases and clauses, prepositional phrases) to provide details (e.g., time, manner, place, cause) about a variety of familiar and new activities and processes."
  },
  {
    "grade": "Grade 8",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 6,
    "title": "Connecting ideas",
    "ccss_ela": "W.8.15; WHST.8.12, 45; SL.8.4, 6; L.8.1, 36",
    "emerging": "Combine clauses in a few basic ways to make connections between and join ideas (e.g., creating compound sentences using and, but, so; creating complex sentences using because).",
    "expanding": "Combine clauses in an increasing variety of ways (e.g., creating compound and complex sentences) to make connections between and join ideas, for example, to express a reason (e.g., He stayed at home on Sunday to study for Monday's exam) or to make a concession (e.g., She studied all night even though she wasn't feeling well).",
    "bridging": "Combine clauses in a wide variety of ways (e.g., creating compound and complex sentences, and compound-complex sentences) to make connections between and join ideas, for example, to show the relationship between multiple events or ideas (e.g., After eating lunch, the students worked in groups while their teacher walked around the room) or to evaluate an argument (e.g., The author claims X, although there is a lack of evidence to support this claim)."
  },
  {
    "grade": "Grade 8",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 7,
    "title": "Condensing ideas",
    "ccss_ela": "W.8.15; WHST.8.12, 45; SL.8.4, 6; L.8.1, 36",
    "emerging": "Condense ideas in simple ways (e.g., by compounding verbs, adding prepositional phrases, or through simple embedded clauses or other ways of condensing as in, This is a story about a girl. The girl changed the world. -> This is a story about a girl who changed the world) to create precise and detailed sentences.",
    "expanding": "Condense ideas in an increasing variety of ways (e.g., through various types of embedded clauses and other ways of condensing as in, Organic vegetables are food. They're made without chemical fertilizers. They're made without chemical insecticides. -> Organic vegetables are foods that are made without chemical fertilizers or insecticides) to create precise and detailed sentences.",
    "bridging": "Condense ideas in a variety of ways (e.g., through various types of embedded clauses, ways of condensing, and nominalization as in, They destroyed the rain forest. Lots of animals died. -> The destruction of the rain forest led to the death of many animals) to create precise and detailed sentences."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 1,
    "title": "Exchanging information/ideas",
    "ccss_ela": "SL.910.1, 6; L.910.3, 6",
    "emerging": "Engage in conversational exchanges and express ideas on familiar current events and academic topics by asking and answering yes-no and wh- questions and responding using phrases and short sentences.",
    "expanding": "Contribute to class, group, and partner discussions, sustaining conversations on a variety of age and grade-appropriate academic topics by following turn-taking rules, asking and answering relevant, on-topic questions, affirming others, providing additional, relevant information, and paraphrasing key ideas.",
    "bridging": "Contribute to class, group, and partner discussions, sustaining conversations on a variety of age and grade-appropriate academic topics by following turn-taking rules, asking and answering relevant, on-topic questions, affirming others, and providing coherent and well-articulated comments and additional information."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 2,
    "title": "Interacting via written English",
    "ccss_ela": "W.910.6; WHST.910.6; SL.910.2; L.910.3, 6",
    "emerging": "Collaborate with peers to engage in short, grade-appropriate written exchanges and writing projects, using technology as appropriate.",
    "expanding": "Collaborate with peers to engage in increasingly complex grade-appropriate written exchanges and writing projects, using technology as appropriate.",
    "bridging": "Collaborate with peers to engage in a variety of extended written exchanges and complex grade-appropriate writing projects, using technology as appropriate."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 3,
    "title": "Supporting opinions and persuading others",
    "ccss_ela": "W.910.1; WHST.910.1; SL.910.1, 4, 6; L.910.3, 6",
    "emerging": "Negotiate with or persuade others in conversations using learned phrases (e.g., Would you say that again? I think...), as well as open responses to express and defend opinions.",
    "expanding": "Negotiate with or persuade others in conversations (e.g., to provide counterarguments) using a growing number of learned phrases (I see your point, but...) and open responses to express and defend nuanced opinions.",
    "bridging": "Negotiate with or persuade others in conversations in appropriate registers (e.g., to acknowledge new information in an academic conversation but then politely offer a counterpoint) using a variety of learned phrases, indirect reported speech (e.g., I heard you say X, and I haven't thought about that before. However...), and open responses to express and defend nuanced opinions."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 4,
    "title": "Adapting language choices",
    "ccss_ela": "W.910.4-5; WHST. 910.45; SL.910.6; L.910.1, 3, 6",
    "emerging": "Adjust language choices according to the context (e.g., classroom, community) and audience (e.g., peers, teachers).",
    "expanding": "Adjust language choices according to the context (e.g., classroom, community), purpose (e.g., to persuade, to provide arguments or counterarguments), task, and audience (e.g., peers, teachers, guest lecturer).",
    "bridging": "Adjust language choices according to the task (e.g., group presentation of research project), context (e.g., classroom, community), purpose (e.g., to persuade, to provide arguments or counterarguments), and audience (e.g., peers, teachers, college recruiter)."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 5,
    "title": "Listening actively",
    "ccss_ela": "SL.910.1, 3, 6; L.910.1, 3, 6",
    "emerging": "Demonstrate comprehension of oral presentations and discussions on familiar social and academic topics by asking and answering questions, with prompting and substantial support.",
    "expanding": "Demonstrate comprehension of oral presentations and discussions on a variety of social and academic topics by asking and answering questions that show thoughtful consideration of the ideas or arguments, with moderate support.",
    "bridging": "Demonstrate comprehension of oral presentations and discussions on a variety of social and academic topics by asking and answering detailed and complex questions that show thoughtful consideration of the ideas or arguments, with light support."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 6,
    "title": "Reading/viewing closely",
    "ccss_ela": "RL.910.17, 910; RI.910.110; RH.910.110; RST.910.110; SL.910.2; L.910.1, 3, 6",
    "emerging": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, evidence-based argument) based on close reading of a variety of grade-appropriate texts, presented in various print and multimedia formats, using short sentences and a select set of general academic and domain-specific words.<br>b. Explain inferences and conclusions drawn from close reading of grade appropriate texts and viewing of multimedia, using familiar verbs (e.g., seems that).<br>c. Use knowledge of morphology (e.g., common prefixes and suffixes), context, reference materials, and visual cues to determine the meaning of unknown and multiple-meaning words on familiar topics.",
    "expanding": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, evidence-based argument) based on close reading of a variety of grade appropriate texts, presented in various print and multimedia formats, using increasingly detailed sentences, and an increasing variety of general academic and domain specific words.<br>b. Explain inferences and conclusions drawn from close reading of grade-appropriate texts and viewing of multimedia using an increasing variety of verbs and adverbials (e.g., indicates that, suggests, as a result).<br>c. Use knowledge of morphology (e.g., affixes, Greek and Latin roots), context, reference materials, and visual cues to determine the meaning of unknown and multiple-meaning words on familiar and new topics.",
    "bridging": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, evidence-based argument) based on close reading of a variety of grade-level texts, presented in various print and multimedia formats, using a variety of detailed sentences and precise general academic and domain-specific words.<br>b. Explain inferences and conclusions drawn from close reading of grade-level texts and viewing of multimedia using a variety of verbs and adverbials (e.g., creates the impression that, consequently).<br>c. Use knowledge of morphology (e.g., derivational suffixes), context, reference materials, and visual cues to determine the meaning, including figurative and connotative meanings, of unknown and multiple-meaning words on a variety of new topics."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 7,
    "title": "Evaluating language choices",
    "ccss_ela": "RL.910.45; RI.910.4, 6, 8; RH.910.46, 8; RST.910.46, 8; SL.910.3; L.910.3, 56",
    "emerging": "Explain how successfully writers and speakers structure texts and use language (e.g., specific word or phrasing choices) to persuade the reader (e.g., by providing evidence to support claims or connecting points in an argument) or create other specific effects, with substantial support.",
    "expanding": "Explain how successfully writers and speakers structure texts and use language (e.g., specific word or phrasing choices) to persuade the reader (e.g., by providing well-worded evidence to support claims or connecting points in an argument in specific ways) or create other specific effects, with moderate support.",
    "bridging": "Explain how successfully writers and speakers structure texts and use language (e.g., specific word or phrasing choices) to persuade the reader (e.g., by providing well-worded evidence to support claims or connecting points in an argument in specific ways) or create other specific effects, with light support."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 8,
    "title": "Analyzing language choices",
    "ccss_ela": "RL.910.45; RI.910.45; RH.910.45; RST.910.45; SL.910.3; L.910.3, 56",
    "emerging": "Explain how a writer's or speaker's choice of phrasing or specific words (e.g., describing a character or action as aggressive versus bold) produces nuances and different effects on the audience.",
    "expanding": "Explain how a writer's or speaker's choice of phrasing or specific words (e.g., using figurative language or words with multiple meanings to describe an event or character) produces nuances and different effects on the audience.",
    "bridging": "Explain how a writer's or speaker's choice of a variety of different types of phrasing or words (e.g., hyperbole, varying connotations, the cumulative impact of word choices) produces nuances and different effects on the audience."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 9,
    "title": "Presenting",
    "ccss_ela": "SL.910.46; L.910.1, 3",
    "emerging": "Plan and deliver brief oral presentations and reports on grade-appropriate topics that present evidence and facts to support ideas.",
    "expanding": "Plan and deliver a variety of oral presentations and reports on grade-appropriate topics that present evidence and facts to support ideas by using growing understanding of register.",
    "bridging": "Plan and deliver a variety of oral presentations and reports on grade-appropriate topics that express complex and abstract ideas, well supported by evidence and reasoning, and are delivered by using an appropriate level of formality and understanding of register."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 10,
    "title": "Writing",
    "ccss_ela": "W.910.110; WHST.910.12, 410; L.910.16",
    "emerging": "a. Write short literary and informational texts (e.g., an argument about water rights) collaboratively (e.g., with peers) and independently.<br>b. Write brief summaries of texts and experiences by using complete sentences and key words (e.g., from notes or graphic organizers).",
    "expanding": "a. Write longer literary and informational texts (e.g., an argument about water rights) collaboratively (e.g., with peers) and independently by using appropriate text organization and growing understanding of register.<br>b. Write increasingly concise summaries of texts and experiences by using complete sentences and key words (e.g., from notes or graphic organizers).",
    "bridging": "a. Write longer and more detailed literary and informational texts (e.g., an argument about water rights) collaboratively (e.g., with peers) and independently using appropriate text organization and register.<br>b. Write clear and coherent summaries of texts and experiences by using complete and concise sentences and key words (e.g., from notes or graphic organizers)."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 11,
    "title": "Justifying/arguing",
    "ccss_ela": "W.910.1, 89; WHST.910.1, 89; L.910.13, 6",
    "emerging": "a. Justify opinions by articulating some relevant textual evidence or background knowledge, with visual support.<br>b. Express attitude and opinions or temper statements with familiar modal expressions (e.g., can, may).",
    "expanding": "a. Justify opinions and positions or persuade others by making connections between ideas and articulating relevant textual evidence or background knowledge.<br>b. Express attitude and opinions or temper statements with a variety of familiar modal expressions (e.g., possibly/likely, could/would).",
    "bridging": "a. Justify opinions or persuade others by making connections and distinctions between ideas and texts and articulating sufficient, detailed, and relevant textual evidence or background knowledge, using appropriate register.<br>b. Express attitude and opinions or temper statements with nuanced modal expressions (e.g., possibly/potentially/certainly/absolutely, should/might)."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 12,
    "title": "Selecting language resources",
    "ccss_ela": "W.910.45; WHST.910.45; SL.910.4, 6; L.910.1, 3, 56",
    "emerging": "a. Use familiar general academic (e.g., temperature, document) and domain specific (e.g., characterization, photosynthesis, society, quadratic functions) words to create clear spoken and written texts.<br>b. Use knowledge of morphology to appropriately select basic affixes (e.g., The skull protects the brain).",
    "expanding": "a. Use an increasing variety of grade appropriate general academic (e.g., dominate, environment) and domain-specific (e.g., characterization, photosynthesis, society, quadratic functions) academic words accurately and appropriately when producing increasingly complex written and spoken texts.<br>b. Use knowledge of morphology to appropriately select affixes in a growing number of ways to manipulate language (e.g., diplomatic, stems are branched or unbranched).",
    "bridging": "a. Use a variety of grade-appropriate general (e.g., anticipate, transaction) and domain-specific (e.g., characterization, photosynthesis, society, quadratic functions) academic words and phrases, including persuasive language, accurately and appropriately when producing complex written and spoken texts.<br>b. Use knowledge of morphology to appropriately select affixes in a variety of ways to manipulate language (e.g., changing inaugurate to inauguration)."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 1,
    "title": "Understanding text structure",
    "ccss_ela": "RL.910.5; RI.910.5; RH.910.5; RST.910.5; W.910.15, 10; WHST.910.1-2, 45, 10; SL.910.4",
    "emerging": "Apply analysis of the organizational structure of different text types (e.g., how arguments are organized by establishing clear relationships among claims, counterclaims, reasons, and evidence) to comprehending texts and to writing brief arguments, informative/explanatory texts, and narratives.",
    "expanding": "Apply analysis of the organizational structure of different text types (e.g., how arguments are organized by establishing clear relationships among claims, counterclaims, reasons, and evidence) to comprehending texts and to writing increasingly clear and cohesive arguments, informative/explanatory texts, and narratives.",
    "bridging": "Apply analysis of the organizational structure of different text types (e.g., how arguments are organized by establishing clear relationships among claims, counterclaims, reasons, and evidence) to comprehending texts and to writing clear and cohesive arguments, informative/explanatory texts, and narratives."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 2,
    "title": "Understanding cohesion",
    "ccss_ela": "RI.910.5; RH.910.5; RST.910.5; W.910.15, 10; WHST.910.12, 45, 10; L.910.1, 36",
    "emerging": "a. Apply knowledge of familiar language resources for referring to make texts more cohesive (e.g., using pronouns to refer back to nouns in text) to comprehending and writing brief texts.<br>b. Apply knowledge of familiar language resources for linking ideas, events, or reasons throughout a text (e.g., using connecting/transition words and phrases, such as first, second, third) to comprehending and writing brief texts.",
    "expanding": "a. Apply knowledge of a growing number of language resources for referring to make texts more cohesive (e.g., using nominalizations to refer back to an action or activity described earlier) to comprehending texts and to writing increasingly cohesive texts for specific purposes and audiences.<br>b. Apply knowledge of familiar language resources for linking ideas, events, or reasons throughout a text (e.g., using connecting/transition words and phrases, such as meanwhile, however, on the other hand) to comprehending texts and to writing increasingly cohesive texts for specific purposes and audiences.",
    "bridging": "a. Apply knowledge of a variety of language resources for referring to make texts more cohesive (e.g., using nominalization, paraphrasing, or summaries to reference or recap an idea or explanation provided earlier) to comprehending grade-level texts and to writing clear and cohesive grade-level texts for specific purposes and audiences.<br>b. Apply knowledge of familiar language resources for linking ideas, events, or reasons throughout a text (e.g., using connecting/transition words and phrases, such as on the contrary, in addition, moreover) to comprehending grade-level texts and to writing cohesive texts for specific purposes and audiences."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 3,
    "title": "Using verbs and verb phrases",
    "ccss_ela": "W.910.5; WHST.910.5; SL.910.6; L.910.1, 36",
    "emerging": "Use a variety of verbs in different tenses (e.g., past, present, future, simple, progressive) appropriate to the text type and discipline to create short texts on familiar academic topics.",
    "expanding": "Use a variety of verbs in different tenses (e.g., past, present, future, simple, progressive, perfect) appropriate to the text type and discipline to create a variety of texts that explain, describe, and summarize concrete and abstract thoughts and ideas.",
    "bridging": "Use a variety of verbs in different tenses (e.g., past, present, future, simple, progressive, perfect), and mood (e.g., subjunctive) appropriate to the text type and discipline to create a variety of texts that describe concrete and abstract ideas, explain procedures and sequences, summarize texts and ideas, and present and critique points of view."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 4,
    "title": "Using nouns and noun phrases",
    "ccss_ela": "W.910.5; WHST.910.5; SL.910.6; L.910.1, 36",
    "emerging": "Expand noun phrases to create increasingly detailed sentences (e.g., adding adjectives for precision) about personal and familiar academic topics.",
    "expanding": "Expand noun phrases in a growing number of ways (e.g., adding adjectives to nouns, simple clause embedding) to create detailed sentences that accurately describe, explain, and summarize information and ideas on a variety of personal and academic topics.",
    "bridging": "Expand noun phrases in a variety of ways (e.g., more complex clause embedding) to create detailed sentences that accurately describe concrete and abstract ideas, explain procedures and sequences, summarize texts and ideas, and present and critique points of view on a variety of academic topics."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 5,
    "title": "Modifying to add details",
    "ccss_ela": "W.910.45; WHST.910.45; SL.910.6; L.910.1, 36",
    "emerging": "Expand sentences with simple adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause) about familiar activities or processes.",
    "expanding": "Expand sentences with a growing variety of adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause) about familiar or new activities or processes.",
    "bridging": "Expand sentences with a variety of adverbials (e.g., adverbs, adverb phrases and clauses, prepositional phrases) to provide details (e.g., time, manner, place, cause) about a variety of familiar and new activities and processes."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 6,
    "title": "Connecting ideas",
    "ccss_ela": "W.910.1-5; WHST.910.12, 45; SL.910.4, 6; L.910.1, 36",
    "emerging": "Combine clauses in a few basic ways (e.g., creating compound sentences using and, but, so; creating complex sentences using because) to make connections between and to join ideas (e.g., I want to read this book because it describes the solar system).",
    "expanding": "Combine clauses in a growing number of ways to create compound and complex sentences that make connections between and link concrete and abstract ideas, for example, to express a reason (e.g., He stayed at home on Sunday in order to study for Monday's exam) or to make a concession (e.g., She studied all night even though she wasn't feeling well).",
    "bridging": "Combine clauses in a variety of ways to create compound and complex sentences that make connections between and link concrete and abstract ideas, for example, to make a concession (e.g., While both characters strive for success, they each take different approaches through which to reach their goals) or to establish cause (e.g., Women's lives were changed forever after World War II as a result of joining the workforce)."
  },
  {
    "grade": "Grade 9-10",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 7,
    "title": "Condensing ideas",
    "ccss_ela": "W.910.15; WHST.910.12, 45; SL.910.4, 6; L.910.1, 36",
    "emerging": "Condense ideas in a few basic ways (e.g., by compounding verb or prepositional phrases) to create precise and detailed simple, compound, and complex sentences (e.g., The students asked survey questions and recorded the responses).",
    "expanding": "Condense ideas in a growing number of ways (e.g., through embedded clauses or by compounding verbs or prepositional phrases) to create more precise and detailed simple, compound, and complex sentences (e.g., Species that could not adapt to the changing climate eventually disappeared).",
    "bridging": "Condense ideas in a variety of ways (e.g., through a variety of embedded clauses, or by compounding verbs or prepositional phrases, nominalization) to create precise simple, compound, and complex sentences that condense concrete and abstract ideas (e.g., Another issue that people may be concerned with is the amount of money that it will cost to construct the new building)."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 1,
    "title": "Exchanging information/ideas",
    "ccss_ela": "SL.1112.1, 6; L.1112.3, 6",
    "emerging": "Engage in conversational exchanges and express ideas on familiar current events and academic topics by asking and answering yes-no and wh- questions and responding using phrases and short sentences.",
    "expanding": "Contribute to class, group, and partner discussions, sustaining conversations on a variety of age and grade-appropriate academic topics by following turn-taking rules, asking and answering relevant, on-topic questions, affirming others, providing additional, relevant information, and paraphrasing key ideas.",
    "bridging": "Contribute to class, group, and partner discussions, sustaining conversations on a variety of age and grade-appropriate academic topics by following turn-taking rules, asking and answering relevant, on-topic questions, affirming others, and providing coherent and well-articulated comments and additional information."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 2,
    "title": "Interacting via written English",
    "ccss_ela": "W.1112.6; WHST.1112.6; SL.1112.2; L.1112.3, 6",
    "emerging": "Collaborate with peers to engage in short, grade-appropriate written exchanges and writing projects, using technology as appropriate.",
    "expanding": "Collaborate with peers to engage in increasingly complex grade-appropriate written exchanges and writing projects, using technology as appropriate.",
    "bridging": "Collaborate with peers to engage in a variety of extended written exchanges and complex grade-appropriate writing projects, using technology as appropriate."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 3,
    "title": "Supporting opinions and persuading others",
    "ccss_ela": "W.1112.1; WHST.1112.1; SL.1112.1, 4, 6; L.1112.3, 6",
    "emerging": "Negotiate with or persuade others in conversations (e.g., ask for clarification or repetition) using learned phrases (e.g., Could you repeat that please? I believe...) and open responses to express and defend opinions.",
    "expanding": "Negotiate with and persuade others (e.g., by presenting counterarguments) in discussions and conversations using learned phrases (e.g., You make a valid point, but my view is...) and open responses to express and defend nuanced opinions.",
    "bridging": "Negotiate with or persuade others in discussions and conversations in appropriate registers (e.g., to acknowledge new information and politely offer a counterpoint) using a variety of learned phrases (e.g., You postulate that X. However, I've reached a different conclusion on this issue) and open responses to express and defend nuanced opinions."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "A. Collaborative",
    "number": 4,
    "title": "Adapting language choices",
    "ccss_ela": "W.1112.45; WHST.1112.45; SL.1112.6; L.1112.1, 3, 6",
    "emerging": "Adjust language choices according to the context (e.g., classroom, community) and audience (e.g., peers, teachers).",
    "expanding": "Adjust language choices according to the context (e.g., classroom, community), purpose (e.g., to persuade, to provide arguments or counterarguments), task, and audience (e.g., peers, teachers, guest lecturer).",
    "bridging": "Adjust language choices according to the task (e.g., group presentation of research project), context (e.g., classroom, community), purpose (e.g., to persuade, to provide arguments or counterarguments), and audience (e.g., peers, teachers, college recruiter)."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 5,
    "title": "Listening actively",
    "ccss_ela": "SL.1112.1, 3, 6; L.1112.1, 3, 6",
    "emerging": "Demonstrate comprehension of oral presentations and discussions on familiar social and academic topics by asking and answering questions with prompting and substantial support.",
    "expanding": "Demonstrate comprehension of oral presentations and discussions on a variety of social and academic topics by asking and answering questions that show thoughtful consideration of the ideas or arguments with moderate support.",
    "bridging": "Demonstrate comprehension of oral presentations and discussions on a variety of social and academic topics by asking and answering detailed and complex questions that show thoughtful consideration of the ideas or arguments with light support."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 6,
    "title": "Reading/viewing closely",
    "ccss_ela": "RL.1112.17, 910; RI.1112.110; RH.1112.110; RST.1112.110; SL.1112.2; L.1112.1, 3, 6",
    "emerging": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, evidence-based argument) based on close reading of a variety of grade-appropriate texts, presented in various print and multimedia formats, using phrases, short sentences, and a select set of general academic and domain-specific words.<br>b. Explain inferences and conclusions drawn from close reading of grade appropriate texts and viewing of multimedia, using familiar verbs (e.g., seems that).<br>c. Use knowledge of morphology (e.g., common prefixes and suffixes), context, reference materials, and visual cues to determine the meaning of unknown and multiple-meaning words on familiar topics.",
    "expanding": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, evidence-based argument) based on close reading of a variety of grade appropriate texts, presented in various print and multimedia formats, using increasingly detailed sentences, and a range of general academic and domain-specific words.<br>b. Explain inferences and conclusions drawn from close reading of grade-appropriate texts and viewing of multimedia using a variety of verbs and adverbials (e.g., indicates that, suggests, as a result).<br>c. Use knowledge of morphology (e.g., affixes, Greek and Latin roots), context, reference materials, and visual cues to determine the meaning of unknown and multiple-meaning words on familiar and new topics.",
    "bridging": "a. Explain ideas, phenomena, processes, and text relationships (e.g., compare/contrast, cause/effect, evidence-based argument) based on close reading of a variety of grade-level texts, presented in various print and multimedia formats, using a variety of detailed sentences and precise general academic and domain-specific words.<br>b. Explain inferences and conclusions drawn from close reading of grade-level texts and viewing of multimedia using a variety of verbs and adverbials (e.g., creates the impression that, consequently).<br>c. Use knowledge of morphology (e.g., derivational suffixes), context, reference materials, and visual cues to determine the meaning, including figurative and connotative meanings, of unknown and multiple-meaning words on a variety of new topics."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 7,
    "title": "Evaluating language choices",
    "ccss_ela": "RL.1112.45; RI.1112.4, 6, 8; RH.1112.46, 8; RST.1112.46, 8; SL.1112.3; L.1112.3, 56",
    "emerging": "Explain how successfully writers and speakers structure texts and use language (e.g., specific word or phrasing choices) to persuade the reader (e.g., by providing evidence to support claims or connecting points in an argument) or create other specific effects, with substantial support.",
    "expanding": "Explain how successfully writers and speakers structure texts and use language (e.g., specific word or phrasing choices) to persuade the reader (e.g., by providing well-worded evidence to support claims or connecting points in an argument in specific ways) or create other specific effects, with moderate support.",
    "bridging": "Explain how successfully writers and speakers structure texts and use language (e.g., specific word or phrasing choices) to persuade the reader (e.g., by providing well-worded evidence to support claims or connecting points in an argument in specific ways) or create other specific effects, with light support."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "B. Interpretive",
    "number": 8,
    "title": "Analyzing language choices",
    "ccss_ela": "RL.1112.45; RI.1112.45; RH.1112.45; RST.1112.45; SL.1112.3; L.1112.3, 56",
    "emerging": "Explain how a writer's or speaker's choice of phrasing or specific words (e.g., describing a character or action as aggressive versus bold) produces nuances or different effects on the audience.",
    "expanding": "Explain how a writer's or speaker's choice of phrasing or specific words (e.g., using figurative language or words with multiple meanings to describe an event or character) produces nuances and different effects on the audience.",
    "bridging": "Explain how a writer's or speaker's choice of a variety of different types of phrasing or words (e.g., hyperbole, varying connotations, the cumulative impact of word choices) produces nuances and different effects on the audience."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 9,
    "title": "Presenting",
    "ccss_ela": "SL.1112.46; L.1112.1, 3",
    "emerging": "Plan and deliver brief oral presentations and reports on grade-appropriate topics that present evidence and facts to support ideas.",
    "expanding": "Plan and deliver a variety of oral presentations and reports on grade-appropriate topics that present evidence and facts to support ideas by using growing understanding of register.",
    "bridging": "Plan and deliver a variety of oral presentations and reports on grade-appropriate topics that express complex and abstract ideas, well supported by evidence and reasoning, and are delivered by using an appropriate level of formality and understanding of register."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 10,
    "title": "Writing",
    "ccss_ela": "W.1112.110; WHST.1112.12, 410; L.1112.16",
    "emerging": "a. Write short literary and informational texts (e.g., an argument about free speech) collaboratively (e.g., with peers) and independently.<br>b. Write brief summaries of texts and experiences by using complete sentences and key words (e.g., from notes or graphic organizers).",
    "expanding": "a. Write longer literary and informational texts (e.g., an argument about free speech) collaboratively (e.g., with peers) and independently by using appropriate text organization and growing understanding of register.<br>b. Write increasingly concise summaries of texts and experiences by using complete sentences and key words (e.g., from notes or graphic organizers).",
    "bridging": "a. Write longer and more detailed literary and informational texts (e.g., an argument about free speech) collaboratively (e.g., with peers) and independently by using appropriate text organization and register.<br>b. Write clear and coherent summaries of texts and experiences by using complete and concise sentences and key words (e.g., from notes or graphic organizers)."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 11,
    "title": "Justifying/arguing",
    "ccss_ela": "W.1112.1, 89; WHST.1112.1, 89; L.1112.13, 6",
    "emerging": "a. Justify opinions by articulating some textual evidence or background knowledge with visual support.<br>b. Express attitude and opinions or temper statements with familiar modal expressions (e.g., can, may).",
    "expanding": "a. Justify opinions and positions or persuade others by making connections between ideas and articulating relevant textual evidence or background knowledge.<br>b. Express attitude and opinions or temper statements with a variety of familiar modal expressions (e.g., possibly/likely, could/would).",
    "bridging": "a. Justify opinions or persuade others by making connections and distinctions between ideas and texts and articulating sufficient, detailed, and relevant textual evidence or background knowledge by using appropriate register.<br>b. Express attitude and opinions or temper statements with nuanced modal expressions (e.g., possibly/potentially/certainly/absolutely, should/might)."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part I: Interacting in Meaningful Ways",
    "mode": "C. Productive",
    "number": 12,
    "title": "Selecting language resources",
    "ccss_ela": "W.1112.45; WHST.1112.45; SL.1112.4, 6; L.1112.1, 3, 56",
    "emerging": "a. Use familiar general academic (e.g., temperature, document) and domain specific (e.g., cell, the Depression) words to create clear spoken and written texts.<br>b. Use knowledge of morphology to appropriately select basic affixes (e.g., The news media relies on official sources).",
    "expanding": "a. Use an increasing variety of grade appropriate general academic (e.g., fallacy, dissuade) and domain-specific (e.g., chromosome, federalism) academic words accurately and appropriately when producing increasingly complex written and spoken texts.<br>b. Use knowledge of morphology to appropriately select affixes in a growing number of ways to manipulate language (e.g., The cardiac muscle works continuously).",
    "bridging": "a. Use a variety of grade-appropriate general (e.g., alleviate, salutary) and domain-specific (e.g., soliloquy, microorganism) academic words and phrases, including persuasive language, accurately and appropriately when producing complex written and spoken texts.<br>b. Use knowledge of morphology to appropriately select affixes in a variety of ways to manipulate language (e.g., changing inaugurate to inauguration)."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 1,
    "title": "Understanding text structure",
    "ccss_ela": "RL.1112.5; RI.1112.5; RH.1112.5; RST.1112.5; W.1112.15, 10; WHST.1112.12, 45, 10; SL.1112.4",
    "emerging": "Apply analysis of the organizational structure of different text types (e.g., how arguments are organized by establishing clear relationships among claims, counterclaims, reasons, and evidence) to comprehending texts and to writing brief arguments, informative/explanatory texts, and narratives.",
    "expanding": "Apply analysis of the organizational structure of different text types (e.g., how arguments are organized by establishing clear relationships among claims, counterclaims, reasons, and evidence) to comprehending texts and to writing increasingly clear and cohesive arguments, informative/explanatory texts, and narratives.",
    "bridging": "Apply analysis of the organizational structure of different text types (e.g., how arguments are organized by establishing clear relationships among claims, counterclaims, reasons, and evidence) to comprehending texts and to writing clear and cohesive arguments, informative/explanatory texts, and narratives."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part II: Learning About How English Works",
    "mode": "A. Structuring Cohesive Texts",
    "number": 2,
    "title": "Understanding cohesion",
    "ccss_ela": "RI.1112.5; RH.1112.5; RST.1112.5; W.1112.15, 10; WHST.1112.12, 45, 10; L.1112.1, 36",
    "emerging": "a. Apply knowledge of familiar language resources for referring to make texts more cohesive (e.g., using pronouns or synonyms to refer back to characters or concepts introduced earlier) to comprehending and writing brief texts.<br>b. Apply knowledge of familiar language resources for linking ideas, events, or reasons throughout a text (e.g., using connecting/transition words and phrases, such as first, second, finally) to comprehending and writing brief texts.",
    "expanding": "a. Apply knowledge of a growing number of language resources for referring to make texts more cohesive (e.g., using nominalizations to refer back to an action or activity described earlier) to comprehending texts and to writing increasingly cohesive texts for specific purposes and audiences.<br>b. Apply knowledge of familiar language resources for linking ideas, events, or reasons throughout a text (e.g., using connecting/transition words and phrases, such as meanwhile, however, on the other hand) to comprehending texts and to writing increasingly cohesive texts for specific purposes and audiences.",
    "bridging": "a. Apply knowledge of a variety of resources for referring to make texts more cohesive (e.g., using nominalization, paraphrases, or summaries to reference or recap an idea or explanation provided earlier) to comprehending grade-level texts and to writing clear and cohesive texts for specific purposes and audiences.<br>b. Apply knowledge of familiar language resources for linking ideas, events, or reasons throughout a text (e.g., using connecting/transition words and phrases, such as on the contrary, in addition, moreover) to comprehending grade-level texts and writing cohesive texts for specific purposes and audiences."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 3,
    "title": "Using verbs and verb phrases",
    "ccss_ela": "W.1112.5; WHST.1112.5; SL.1112.6; L.1112.1, 36",
    "emerging": "Use a variety of verbs in different tenses (e.g., past, present, future, simple, progressive) appropriate to the text type and discipline to create short texts on familiar academic topics.",
    "expanding": "Use a variety of verbs in different tenses (e.g., past, present, future, simple, progressive, perfect) appropriate to the text type and discipline to create a variety of texts that explain, describe, and summarize concrete and abstract thoughts and ideas.",
    "bridging": "Use a variety of verbs in different tenses (e.g., past, present, future, simple, progressive, perfect), and mood (e.g., subjunctive) appropriate to the text type and discipline to create a variety of texts that describe concrete and abstract ideas, explain procedures and sequences, summarize texts and ideas, and present and critique points of view."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 4,
    "title": "Using nouns and noun phrases",
    "ccss_ela": "W.1112.5; WHST.1112.5; SL.1112.6; L.1112.1, 36",
    "emerging": "Expand noun phrases to create increasingly detailed sentences (e.g., adding adjectives for precision) about personal and familiar academic topics.",
    "expanding": "Expand noun phrases in a growing number of ways (e.g., adding adjectives to nouns, simple clause embedding) to create detailed sentences that accurately describe, explain, and summarize information and ideas on a variety of personal and academic topics.",
    "bridging": "Expand noun phrases in a variety of ways (e.g., complex clause embedding) to create detailed sentences that accurately describe concrete and abstract ideas, explain procedures and sequences, summarize texts and ideas, and present and critique points of view on a variety of academic topics."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part II: Learning About How English Works",
    "mode": "B. Expanding and Enriching Ideas",
    "number": 5,
    "title": "Modifying to add details",
    "ccss_ela": "W.1112.45; WHST.1112.45; SL.1112.6; L.1112.1, 36",
    "emerging": "Expand sentences with simple adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause) about familiar activities or processes.",
    "expanding": "Expand sentences with a growing variety of adverbials (e.g., adverbs, adverb phrases, prepositional phrases) to provide details (e.g., time, manner, place, cause) about familiar or new activities or processes.",
    "bridging": "Expand sentences with a variety of adverbials (e.g., adverbs, adverb phrases and clauses, prepositional phrases) to provide details (e.g., time, manner, place, cause) about a variety of familiar and new activities and processes."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 6,
    "title": "Connecting ideas",
    "ccss_ela": "W.1112.15; WHST.1112.12, 45; SL.1112.4, 6; L.1112.1, 36",
    "emerging": "Combine clauses in a few basic ways (e.g., creating compound sentences using and, but, so; creating complex sentences using because) to make connections between and join ideas (e.g., I want to read this book because it tells the history of pi).",
    "expanding": "Combine clauses in a growing number of ways to create compound and complex sentences that make connections between and link concrete and abstract ideas, for example, to express a reason (e.g., He stayed at home on Sunday in order to study for Monday's exam) or to make a concession (e.g., She studied all night even though she wasn't feeling well).",
    "bridging": "Combine clauses in a variety of ways to create compound and complex sentences that make connections between and link concrete and abstract ideas, for example, to make a concession (e.g., While both characters strive for success, they each take different approaches to reach their goals) or to establish cause (e.g., Women's lives were changed forever after World War II as a result of joining the workforce)."
  },
  {
    "grade": "Grades 11-12",
    "part": "Part II: Learning About How English Works",
    "mode": "C. Connecting and Condensing Ideas",
    "number": 7,
    "title": "Condensing ideas",
    "ccss_ela": "W.1112.15; WHST.1112.12, 45; SL.1112.4, 6; L.1112.1, 36",
    "emerging": "Condense ideas in a few basic ways (e.g., by compounding verb or prepositional phrases) to create precise and detailed simple, compound, and complex sentences (e.g., The students asked survey questions and recorded the responses).",
    "expanding": "Condense ideas in a growing number of ways (e.g., through embedded clauses or by compounding verb or prepositional phrases) to create more precise and detailed simple, compound, and complex sentences (e.g., Species that could not adapt to the changing climate eventually disappeared).",
    "bridging": "Condense ideas in a variety of ways (e.g., through a variety of embedded clauses, or by compounding verb or prepositional phrases, nominalization) to create precise simple, compound, and complex sentences that condense concrete and abstract ideas (e.g., The epidemic, which ultimately affected hundreds of thousands of people, did not subside for another year)."
  }
]